TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
       3                    ;* Date/Time created: Fri Mar 20 15:43:33 2026                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("D:/CE2007/inc/Clock.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CE2007\Lab1_C_Programming\Debug")
      13                            .global ClockFrequency
      14 00000000                   .data
      15                            .align  4

     695                            .align  4
     696 00000182 00040001  ||$C$CON3||:    .bits   1073807364,32
         00000186 00004001 
     697                            .align  4
     698 00000186 00004001  ||$C$CON4||:    .bits   1073807360,32
         0000018a 00004001 
     699                            .align  4
     700 0000018a 00014001  ||$C$CON5||:    .bits   1767505921,32
         0000018e 0000695A 
     701                            .align  4
     702 0000018e 000C695A  ||$C$CON6||:    .bits   1073807372,32
         00000192 00004001 
     703                            .align  4
     704 00000192 00004001! ||$C$CON7||:    .bits   IFlags,32
         00000196 00000000 
     705                            .align  4
     706 00000196 00100000  ||$C$CON8||:    .bits   1073807376,32
         0000019a 00004001 
     707                            .align  4
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   14

     708 0000019a 00004001! ||$C$CON9||:    .bits   CPMwait,32
         0000019e 00000000 
     709                            .align  4
     710 0000019e A1200000  ||$C$CON10||:   .bits   500000,32
         000001a2 00000007 
     711                            .align  4
     712 000001a2 00000007! ||$C$CON11||:   .bits   Postwait,32
         000001a6 00000000 
     713                            .align  4
     714 000001a6 4D2A0000  ||$C$CON12||:   .bits   1073761578,32
         000001aa 00004000 
     715                            .align  4
     716 000001aa 4D2C4000  ||$C$CON13||:   .bits   1073761580,32
         000001ae 00004000 
     717                            .align  4
     718 000001ae 04004000  ||$C$CON14||:   .bits   1073808384,32
         000001b2 00004001 
     719                            .align  4
     720 000001b2 040C4001  ||$C$CON15||:   .bits   1073808396,32
         000001b6 00004001 
     721                            .align  4
     722 000001b6 00004001  ||$C$CON16||:   .bits   23134208,32
         000001ba 00000161 
     723                            .align  4
     724 000001ba 04500161  ||$C$CON17||:   .bits   1073808464,32
         000001be 00004001 
     725                            .align  4
     726 000001be 00004001! ||$C$CON18||:   .bits   Crystalstable,32
         000001c2 00000000 
     727                            .align  4
     728 000001c2 04480000  ||$C$CON19||:   .bits   1073808456,32
         000001c6 00004001 
     729                            .align  4
     730 000001c6 10104001  ||$C$CON20||:   .bits   1073811472,32
         000001ca 00004001 
     731                            .align  4
     732 000001ca 10144001  ||$C$CON21||:   .bits   1073811476,32
         000001ce 00004001 
     733                            .align  4
     734 000001ce 04084001  ||$C$CON22||:   .bits   1073808392,32
         000001d2 00004001 
     735                            .align  4
     736 000001d2 02554001  ||$C$CON23||:   .bits   537920085,32
         000001d6 00002010 
     737                            .align  4
     738 000001d6 00002010! ||$C$CON24||:   .bits   ClockFrequency,32
         000001da 00000000 
     739                            .align  4
     740 000001da 6C000000  ||$C$CON25||:   .bits   48000000,32
         000001de 000002DC 
     741                    
     742                    ;******************************************************************************
     743                    ;* BUILD ATTRIBUTES                                                           *
     744                    ;******************************************************************************
     745                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   15

     746                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     747                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     748                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     749                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     750                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     751                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     752                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     753                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     754                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     755                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     756                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     757                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     758                    
     759                    ;******************************************************************************
     760                    ;* TYPE INFORMATION                                                           *
     761                    ;******************************************************************************
     762                    
     763                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
     764                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x14)
     765                    $C$DW$24        .dwtag  DW_TAG_member
     766                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     767                            .dwattr $C$DW$24, DW_AT_name("CTL0")
     768                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("CTL0")
     769                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     771                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     772                            .dwattr $C$DW$24, DW_AT_decl_line(0x3e2)
     773                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     774                    
     775                    $C$DW$25        .dwtag  DW_TAG_member
     776                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
     777                            .dwattr $C$DW$25, DW_AT_name("CTL1")
     778                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("CTL1")
     779                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     780                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     781                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     782                            .dwattr $C$DW$25, DW_AT_decl_line(0x3e3)
     783                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     784                    
     785                    $C$DW$26        .dwtag  DW_TAG_member
     786                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     787                            .dwattr $C$DW$26, DW_AT_name("IE")
     788                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("IE")
     789                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     790                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     791                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     792                            .dwattr $C$DW$26, DW_AT_decl_line(0x3e4)
     793                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     794                    
     795                    $C$DW$27        .dwtag  DW_TAG_member
     796                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
     797                            .dwattr $C$DW$27, DW_AT_name("IFG")
     798                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("IFG")
     799                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     800                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   16

     801                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     802                            .dwattr $C$DW$27, DW_AT_decl_line(0x3e5)
     803                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     804                    
     805                    $C$DW$28        .dwtag  DW_TAG_member
     806                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     807                            .dwattr $C$DW$28, DW_AT_name("CLRIFG")
     808                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("CLRIFG")
     809                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     810                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     811                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     812                            .dwattr $C$DW$28, DW_AT_decl_line(0x3e6)
     813                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
     814                    
     815                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     816                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x3e1)
     817                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
     818                            .dwendtag $C$DW$T$22
     819                    
     820                    $C$DW$T$172     .dwtag  DW_TAG_typedef
     821                            .dwattr $C$DW$T$172, DW_AT_name("PCM_Type")
     822                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$22)
     823                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
     824                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     825                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x3e7)
     826                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
     827                    
     828                    
     829                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     830                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     831                    $C$DW$29        .dwtag  DW_TAG_member
     832                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$24)
     833                            .dwattr $C$DW$29, DW_AT_name("SEL0_L")
     834                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("SEL0_L")
     835                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     837                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     838                            .dwattr $C$DW$29, DW_AT_decl_line(0x271)
     839                            .dwattr $C$DW$29, DW_AT_decl_column(0x14)
     840                    
     841                    $C$DW$30        .dwtag  DW_TAG_member
     842                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$24)
     843                            .dwattr $C$DW$30, DW_AT_name("SEL0_H")
     844                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("SEL0_H")
     845                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     846                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     847                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     848                            .dwattr $C$DW$30, DW_AT_decl_line(0x272)
     849                            .dwattr $C$DW$30, DW_AT_decl_column(0x14)
     850                    
     851                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     852                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x270)
     853                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0c)
     854                            .dwendtag $C$DW$T$25
     855                    
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   17

     856                    
     857                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     858                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     859                    $C$DW$31        .dwtag  DW_TAG_member
     860                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$26)
     861                            .dwattr $C$DW$31, DW_AT_name("IN_L")
     862                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("IN_L")
     863                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     865                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     866                            .dwattr $C$DW$31, DW_AT_decl_line(0x24e)
     867                            .dwattr $C$DW$31, DW_AT_decl_column(0x13)
     868                    
     869                    $C$DW$32        .dwtag  DW_TAG_member
     870                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$26)
     871                            .dwattr $C$DW$32, DW_AT_name("IN_H")
     872                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("IN_H")
     873                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     874                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     875                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     876                            .dwattr $C$DW$32, DW_AT_decl_line(0x24f)
     877                            .dwattr $C$DW$32, DW_AT_decl_column(0x13)
     878                    
     879                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     880                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x24d)
     881                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0c)
     882                            .dwendtag $C$DW$T$27
     883                    
     884                    
     885                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     886                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     887                    $C$DW$33        .dwtag  DW_TAG_member
     888                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$24)
     889                            .dwattr $C$DW$33, DW_AT_name("OUT_L")
     890                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("OUT_L")
     891                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     893                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     894                            .dwattr $C$DW$33, DW_AT_decl_line(0x255)
     895                            .dwattr $C$DW$33, DW_AT_decl_column(0x14)
     896                    
     897                    $C$DW$34        .dwtag  DW_TAG_member
     898                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$24)
     899                            .dwattr $C$DW$34, DW_AT_name("OUT_H")
     900                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("OUT_H")
     901                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     902                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     903                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     904                            .dwattr $C$DW$34, DW_AT_decl_line(0x256)
     905                            .dwattr $C$DW$34, DW_AT_decl_column(0x14)
     906                    
     907                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     908                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x254)
     909                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0c)
     910                            .dwendtag $C$DW$T$28
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   18

     911                    
     912                    
     913                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     914                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     915                    $C$DW$35        .dwtag  DW_TAG_member
     916                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$24)
     917                            .dwattr $C$DW$35, DW_AT_name("DIR_L")
     918                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("DIR_L")
     919                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     921                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     922                            .dwattr $C$DW$35, DW_AT_decl_line(0x25c)
     923                            .dwattr $C$DW$35, DW_AT_decl_column(0x14)
     924                    
     925                    $C$DW$36        .dwtag  DW_TAG_member
     926                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$24)
     927                            .dwattr $C$DW$36, DW_AT_name("DIR_H")
     928                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("DIR_H")
     929                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     930                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     931                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     932                            .dwattr $C$DW$36, DW_AT_decl_line(0x25d)
     933                            .dwattr $C$DW$36, DW_AT_decl_column(0x14)
     934                    
     935                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     936                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x25b)
     937                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0c)
     938                            .dwendtag $C$DW$T$29
     939                    
     940                    
     941                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
     942                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     943                    $C$DW$37        .dwtag  DW_TAG_member
     944                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$24)
     945                            .dwattr $C$DW$37, DW_AT_name("REN_L")
     946                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("REN_L")
     947                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     949                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     950                            .dwattr $C$DW$37, DW_AT_decl_line(0x263)
     951                            .dwattr $C$DW$37, DW_AT_decl_column(0x14)
     952                    
     953                    $C$DW$38        .dwtag  DW_TAG_member
     954                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$24)
     955                            .dwattr $C$DW$38, DW_AT_name("REN_H")
     956                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("REN_H")
     957                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     958                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     959                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     960                            .dwattr $C$DW$38, DW_AT_decl_line(0x264)
     961                            .dwattr $C$DW$38, DW_AT_decl_column(0x14)
     962                    
     963                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     964                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x262)
     965                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   19

     966                            .dwendtag $C$DW$T$30
     967                    
     968                    
     969                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     970                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     971                    $C$DW$39        .dwtag  DW_TAG_member
     972                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$24)
     973                            .dwattr $C$DW$39, DW_AT_name("DS_L")
     974                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("DS_L")
     975                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     977                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     978                            .dwattr $C$DW$39, DW_AT_decl_line(0x26a)
     979                            .dwattr $C$DW$39, DW_AT_decl_column(0x14)
     980                    
     981                    $C$DW$40        .dwtag  DW_TAG_member
     982                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$24)
     983                            .dwattr $C$DW$40, DW_AT_name("DS_H")
     984                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("DS_H")
     985                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     986                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     987                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     988                            .dwattr $C$DW$40, DW_AT_decl_line(0x26b)
     989                            .dwattr $C$DW$40, DW_AT_decl_column(0x14)
     990                    
     991                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     992                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x269)
     993                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0c)
     994                            .dwendtag $C$DW$T$31
     995                    
     996                    
     997                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
     998                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     999                    $C$DW$41        .dwtag  DW_TAG_member
    1000                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$24)
    1001                            .dwattr $C$DW$41, DW_AT_name("SEL1_L")
    1002                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("SEL1_L")
    1003                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1005                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1006                            .dwattr $C$DW$41, DW_AT_decl_line(0x278)
    1007                            .dwattr $C$DW$41, DW_AT_decl_column(0x14)
    1008                    
    1009                    $C$DW$42        .dwtag  DW_TAG_member
    1010                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$24)
    1011                            .dwattr $C$DW$42, DW_AT_name("SEL1_H")
    1012                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("SEL1_H")
    1013                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1014                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1015                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1016                            .dwattr $C$DW$42, DW_AT_decl_line(0x279)
    1017                            .dwattr $C$DW$42, DW_AT_decl_column(0x14)
    1018                    
    1019                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1020                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x277)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   20

    1021                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0c)
    1022                            .dwendtag $C$DW$T$32
    1023                    
    1024                    
    1025                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1026                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1027                    $C$DW$43        .dwtag  DW_TAG_member
    1028                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$24)
    1029                            .dwattr $C$DW$43, DW_AT_name("SELC_L")
    1030                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("SELC_L")
    1031                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1033                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1034                            .dwattr $C$DW$43, DW_AT_decl_line(0x280)
    1035                            .dwattr $C$DW$43, DW_AT_decl_column(0x14)
    1036                    
    1037                    $C$DW$44        .dwtag  DW_TAG_member
    1038                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$24)
    1039                            .dwattr $C$DW$44, DW_AT_name("SELC_H")
    1040                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("SELC_H")
    1041                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1042                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1043                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1044                            .dwattr $C$DW$44, DW_AT_decl_line(0x281)
    1045                            .dwattr $C$DW$44, DW_AT_decl_column(0x14)
    1046                    
    1047                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1048                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x27f)
    1049                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0c)
    1050                            .dwendtag $C$DW$T$33
    1051                    
    1052                    
    1053                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1054                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    1055                    $C$DW$45        .dwtag  DW_TAG_member
    1056                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$146)
    1057                            .dwattr $C$DW$45, DW_AT_name("$P$T2")
    1058                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("$P$T2")
    1059                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1061                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1062                            .dwattr $C$DW$45, DW_AT_decl_line(0x24b)
    1063                            .dwattr $C$DW$45, DW_AT_decl_column(0x03)
    1064                    
    1065                    $C$DW$46        .dwtag  DW_TAG_member
    1066                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$147)
    1067                            .dwattr $C$DW$46, DW_AT_name("$P$T4")
    1068                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("$P$T4")
    1069                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1070                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1071                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1072                            .dwattr $C$DW$46, DW_AT_decl_line(0x252)
    1073                            .dwattr $C$DW$46, DW_AT_decl_column(0x03)
    1074                    
    1075                    $C$DW$47        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   21

    1076                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$148)
    1077                            .dwattr $C$DW$47, DW_AT_name("$P$T6")
    1078                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("$P$T6")
    1079                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1080                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1081                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1082                            .dwattr $C$DW$47, DW_AT_decl_line(0x259)
    1083                            .dwattr $C$DW$47, DW_AT_decl_column(0x03)
    1084                    
    1085                    $C$DW$48        .dwtag  DW_TAG_member
    1086                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$149)
    1087                            .dwattr $C$DW$48, DW_AT_name("$P$T8")
    1088                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("$P$T8")
    1089                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1090                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1091                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1092                            .dwattr $C$DW$48, DW_AT_decl_line(0x260)
    1093                            .dwattr $C$DW$48, DW_AT_decl_column(0x03)
    1094                    
    1095                    $C$DW$49        .dwtag  DW_TAG_member
    1096                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$150)
    1097                            .dwattr $C$DW$49, DW_AT_name("$P$T10")
    1098                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("$P$T10")
    1099                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1100                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1101                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1102                            .dwattr $C$DW$49, DW_AT_decl_line(0x267)
    1103                            .dwattr $C$DW$49, DW_AT_decl_column(0x03)
    1104                    
    1105                    $C$DW$50        .dwtag  DW_TAG_member
    1106                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$145)
    1107                            .dwattr $C$DW$50, DW_AT_name("$P$T11")
    1108                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("$P$T11")
    1109                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1110                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1111                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1112                            .dwattr $C$DW$50, DW_AT_decl_line(0x26e)
    1113                            .dwattr $C$DW$50, DW_AT_decl_column(0x03)
    1114                    
    1115                    $C$DW$51        .dwtag  DW_TAG_member
    1116                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$151)
    1117                            .dwattr $C$DW$51, DW_AT_name("$P$T13")
    1118                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("$P$T13")
    1119                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1120                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1121                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1122                            .dwattr $C$DW$51, DW_AT_decl_line(0x275)
    1123                            .dwattr $C$DW$51, DW_AT_decl_column(0x03)
    1124                    
    1125                    $C$DW$52        .dwtag  DW_TAG_member
    1126                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$35)
    1127                            .dwattr $C$DW$52, DW_AT_name("RESERVED0")
    1128                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED0")
    1129                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1130                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   22

    1131                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1132                            .dwattr $C$DW$52, DW_AT_decl_line(0x27c)
    1133                            .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
    1134                    
    1135                    $C$DW$53        .dwtag  DW_TAG_member
    1136                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$152)
    1137                            .dwattr $C$DW$53, DW_AT_name("$P$T15")
    1138                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("$P$T15")
    1139                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1140                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1141                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1142                            .dwattr $C$DW$53, DW_AT_decl_line(0x27d)
    1143                            .dwattr $C$DW$53, DW_AT_decl_column(0x03)
    1144                    
    1145                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1146                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x24a)
    1147                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1148                            .dwendtag $C$DW$T$36
    1149                    
    1150                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1151                            .dwattr $C$DW$T$174, DW_AT_name("DIO_PORT_Not_Interruptable_Type")
    1152                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$36)
    1153                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1154                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1155                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x284)
    1156                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x03)
    1157                    
    1158                    
    1159                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1160                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x68)
    1161                    $C$DW$54        .dwtag  DW_TAG_member
    1162                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
    1163                            .dwattr $C$DW$54, DW_AT_name("KEY")
    1164                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("KEY")
    1165                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1166                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1167                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1168                            .dwattr $C$DW$54, DW_AT_decl_line(0x1d9)
    1169                            .dwattr $C$DW$54, DW_AT_decl_column(0x11)
    1170                    
    1171                    $C$DW$55        .dwtag  DW_TAG_member
    1172                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$20)
    1173                            .dwattr $C$DW$55, DW_AT_name("CTL0")
    1174                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("CTL0")
    1175                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1176                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1177                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1178                            .dwattr $C$DW$55, DW_AT_decl_line(0x1da)
    1179                            .dwattr $C$DW$55, DW_AT_decl_column(0x11)
    1180                    
    1181                    $C$DW$56        .dwtag  DW_TAG_member
    1182                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$20)
    1183                            .dwattr $C$DW$56, DW_AT_name("CTL1")
    1184                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("CTL1")
    1185                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   23

    1186                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1187                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1188                            .dwattr $C$DW$56, DW_AT_decl_line(0x1db)
    1189                            .dwattr $C$DW$56, DW_AT_decl_column(0x11)
    1190                    
    1191                    $C$DW$57        .dwtag  DW_TAG_member
    1192                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
    1193                            .dwattr $C$DW$57, DW_AT_name("CTL2")
    1194                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("CTL2")
    1195                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1196                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1197                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1198                            .dwattr $C$DW$57, DW_AT_decl_line(0x1dc)
    1199                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1200                    
    1201                    $C$DW$58        .dwtag  DW_TAG_member
    1202                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
    1203                            .dwattr $C$DW$58, DW_AT_name("CTL3")
    1204                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("CTL3")
    1205                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1206                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1207                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1208                            .dwattr $C$DW$58, DW_AT_decl_line(0x1dd)
    1209                            .dwattr $C$DW$58, DW_AT_decl_column(0x11)
    1210                    
    1211                    $C$DW$59        .dwtag  DW_TAG_member
    1212                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$37)
    1213                            .dwattr $C$DW$59, DW_AT_name("RESERVED0")
    1214                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("RESERVED0")
    1215                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1216                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1217                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1218                            .dwattr $C$DW$59, DW_AT_decl_line(0x1de)
    1219                            .dwattr $C$DW$59, DW_AT_decl_column(0x11)
    1220                    
    1221                    $C$DW$60        .dwtag  DW_TAG_member
    1222                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
    1223                            .dwattr $C$DW$60, DW_AT_name("CLKEN")
    1224                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("CLKEN")
    1225                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1226                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1227                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1228                            .dwattr $C$DW$60, DW_AT_decl_line(0x1df)
    1229                            .dwattr $C$DW$60, DW_AT_decl_column(0x11)
    1230                    
    1231                    $C$DW$61        .dwtag  DW_TAG_member
    1232                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
    1233                            .dwattr $C$DW$61, DW_AT_name("STAT")
    1234                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("STAT")
    1235                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1236                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1237                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1238                            .dwattr $C$DW$61, DW_AT_decl_line(0x1e0)
    1239                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1240                    
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   24

    1241                    $C$DW$62        .dwtag  DW_TAG_member
    1242                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$38)
    1243                            .dwattr $C$DW$62, DW_AT_name("RESERVED1")
    1244                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED1")
    1245                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1246                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1247                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1248                            .dwattr $C$DW$62, DW_AT_decl_line(0x1e1)
    1249                            .dwattr $C$DW$62, DW_AT_decl_column(0x11)
    1250                    
    1251                    $C$DW$63        .dwtag  DW_TAG_member
    1252                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$20)
    1253                            .dwattr $C$DW$63, DW_AT_name("IE")
    1254                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("IE")
    1255                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1256                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1257                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1258                            .dwattr $C$DW$63, DW_AT_decl_line(0x1e2)
    1259                            .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1260                    
    1261                    $C$DW$64        .dwtag  DW_TAG_member
    1262                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1263                            .dwattr $C$DW$64, DW_AT_name("RESERVED2")
    1264                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED2")
    1265                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1266                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1267                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1268                            .dwattr $C$DW$64, DW_AT_decl_line(0x1e3)
    1269                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
    1270                    
    1271                    $C$DW$65        .dwtag  DW_TAG_member
    1272                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
    1273                            .dwattr $C$DW$65, DW_AT_name("IFG")
    1274                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("IFG")
    1275                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1276                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1277                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1278                            .dwattr $C$DW$65, DW_AT_decl_line(0x1e4)
    1279                            .dwattr $C$DW$65, DW_AT_decl_column(0x11)
    1280                    
    1281                    $C$DW$66        .dwtag  DW_TAG_member
    1282                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1283                            .dwattr $C$DW$66, DW_AT_name("RESERVED3")
    1284                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("RESERVED3")
    1285                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1286                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1287                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1288                            .dwattr $C$DW$66, DW_AT_decl_line(0x1e5)
    1289                            .dwattr $C$DW$66, DW_AT_decl_column(0x11)
    1290                    
    1291                    $C$DW$67        .dwtag  DW_TAG_member
    1292                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1293                            .dwattr $C$DW$67, DW_AT_name("CLRIFG")
    1294                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("CLRIFG")
    1295                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   25

    1296                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1297                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1298                            .dwattr $C$DW$67, DW_AT_decl_line(0x1e6)
    1299                            .dwattr $C$DW$67, DW_AT_decl_column(0x11)
    1300                    
    1301                    $C$DW$68        .dwtag  DW_TAG_member
    1302                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1303                            .dwattr $C$DW$68, DW_AT_name("RESERVED4")
    1304                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("RESERVED4")
    1305                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1306                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1307                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1308                            .dwattr $C$DW$68, DW_AT_decl_line(0x1e7)
    1309                            .dwattr $C$DW$68, DW_AT_decl_column(0x11)
    1310                    
    1311                    $C$DW$69        .dwtag  DW_TAG_member
    1312                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
    1313                            .dwattr $C$DW$69, DW_AT_name("SETIFG")
    1314                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("SETIFG")
    1315                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1316                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1317                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1318                            .dwattr $C$DW$69, DW_AT_decl_line(0x1e8)
    1319                            .dwattr $C$DW$69, DW_AT_decl_column(0x11)
    1320                    
    1321                    $C$DW$70        .dwtag  DW_TAG_member
    1322                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1323                            .dwattr $C$DW$70, DW_AT_name("RESERVED5")
    1324                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("RESERVED5")
    1325                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1326                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1327                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1328                            .dwattr $C$DW$70, DW_AT_decl_line(0x1e9)
    1329                            .dwattr $C$DW$70, DW_AT_decl_column(0x11)
    1330                    
    1331                    $C$DW$71        .dwtag  DW_TAG_member
    1332                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1333                            .dwattr $C$DW$71, DW_AT_name("DCOERCAL0")
    1334                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("DCOERCAL0")
    1335                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1336                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1337                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1338                            .dwattr $C$DW$71, DW_AT_decl_line(0x1ea)
    1339                            .dwattr $C$DW$71, DW_AT_decl_column(0x11)
    1340                    
    1341                    $C$DW$72        .dwtag  DW_TAG_member
    1342                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
    1343                            .dwattr $C$DW$72, DW_AT_name("DCOERCAL1")
    1344                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("DCOERCAL1")
    1345                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1346                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1347                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1348                            .dwattr $C$DW$72, DW_AT_decl_line(0x1eb)
    1349                            .dwattr $C$DW$72, DW_AT_decl_column(0x11)
    1350                    
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   26

    1351                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1352                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1d8)
    1353                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1354                            .dwendtag $C$DW$T$39
    1355                    
    1356                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    1357                            .dwattr $C$DW$T$176, DW_AT_name("CS_Type")
    1358                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$39)
    1359                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    1360                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1361                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x1ec)
    1362                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
    1363                    
    1364                    
    1365                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1366                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x124)
    1367                    $C$DW$73        .dwtag  DW_TAG_member
    1368                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1369                            .dwattr $C$DW$73, DW_AT_name("POWER_STAT")
    1370                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("POWER_STAT")
    1371                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1373                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1374                            .dwattr $C$DW$73, DW_AT_decl_line(0x352)
    1375                            .dwattr $C$DW$73, DW_AT_decl_column(0x11)
    1376                    
    1377                    $C$DW$74        .dwtag  DW_TAG_member
    1378                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$40)
    1379                            .dwattr $C$DW$74, DW_AT_name("RESERVED0")
    1380                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED0")
    1381                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1382                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1383                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1384                            .dwattr $C$DW$74, DW_AT_decl_line(0x353)
    1385                            .dwattr $C$DW$74, DW_AT_decl_column(0x11)
    1386                    
    1387                    $C$DW$75        .dwtag  DW_TAG_member
    1388                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
    1389                            .dwattr $C$DW$75, DW_AT_name("BANK0_RDCTL")
    1390                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("BANK0_RDCTL")
    1391                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1392                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1393                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1394                            .dwattr $C$DW$75, DW_AT_decl_line(0x354)
    1395                            .dwattr $C$DW$75, DW_AT_decl_column(0x11)
    1396                    
    1397                    $C$DW$76        .dwtag  DW_TAG_member
    1398                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1399                            .dwattr $C$DW$76, DW_AT_name("BANK1_RDCTL")
    1400                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("BANK1_RDCTL")
    1401                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1402                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1403                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1404                            .dwattr $C$DW$76, DW_AT_decl_line(0x355)
    1405                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   27

    1406                    
    1407                    $C$DW$77        .dwtag  DW_TAG_member
    1408                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$38)
    1409                            .dwattr $C$DW$77, DW_AT_name("RESERVED1")
    1410                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED1")
    1411                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1412                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1413                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1414                            .dwattr $C$DW$77, DW_AT_decl_line(0x356)
    1415                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1416                    
    1417                    $C$DW$78        .dwtag  DW_TAG_member
    1418                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1419                            .dwattr $C$DW$78, DW_AT_name("RDBRST_CTLSTAT")
    1420                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RDBRST_CTLSTAT")
    1421                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1422                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1423                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1424                            .dwattr $C$DW$78, DW_AT_decl_line(0x357)
    1425                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1426                    
    1427                    $C$DW$79        .dwtag  DW_TAG_member
    1428                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    1429                            .dwattr $C$DW$79, DW_AT_name("RDBRST_STARTADDR")
    1430                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RDBRST_STARTADDR")
    1431                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1432                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1433                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1434                            .dwattr $C$DW$79, DW_AT_decl_line(0x358)
    1435                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1436                    
    1437                    $C$DW$80        .dwtag  DW_TAG_member
    1438                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    1439                            .dwattr $C$DW$80, DW_AT_name("RDBRST_LEN")
    1440                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RDBRST_LEN")
    1441                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1442                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1443                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1444                            .dwattr $C$DW$80, DW_AT_decl_line(0x359)
    1445                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1446                    
    1447                    $C$DW$81        .dwtag  DW_TAG_member
    1448                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$41)
    1449                            .dwattr $C$DW$81, DW_AT_name("RESERVED2")
    1450                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED2")
    1451                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1452                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1453                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1454                            .dwattr $C$DW$81, DW_AT_decl_line(0x35a)
    1455                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1456                    
    1457                    $C$DW$82        .dwtag  DW_TAG_member
    1458                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    1459                            .dwattr $C$DW$82, DW_AT_name("RDBRST_FAILADDR")
    1460                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RDBRST_FAILADDR")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   28

    1461                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1462                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1463                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1464                            .dwattr $C$DW$82, DW_AT_decl_line(0x35b)
    1465                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
    1466                    
    1467                    $C$DW$83        .dwtag  DW_TAG_member
    1468                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1469                            .dwattr $C$DW$83, DW_AT_name("RDBRST_FAILCNT")
    1470                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RDBRST_FAILCNT")
    1471                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1472                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1473                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1474                            .dwattr $C$DW$83, DW_AT_decl_line(0x35c)
    1475                            .dwattr $C$DW$83, DW_AT_decl_column(0x11)
    1476                    
    1477                    $C$DW$84        .dwtag  DW_TAG_member
    1478                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$40)
    1479                            .dwattr $C$DW$84, DW_AT_name("RESERVED3")
    1480                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED3")
    1481                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1482                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1483                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1484                            .dwattr $C$DW$84, DW_AT_decl_line(0x35d)
    1485                            .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1486                    
    1487                    $C$DW$85        .dwtag  DW_TAG_member
    1488                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
    1489                            .dwattr $C$DW$85, DW_AT_name("PRG_CTLSTAT")
    1490                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRG_CTLSTAT")
    1491                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1492                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1493                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1494                            .dwattr $C$DW$85, DW_AT_decl_line(0x35e)
    1495                            .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1496                    
    1497                    $C$DW$86        .dwtag  DW_TAG_member
    1498                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
    1499                            .dwattr $C$DW$86, DW_AT_name("PRGBRST_CTLSTAT")
    1500                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRGBRST_CTLSTAT")
    1501                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1502                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1503                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1504                            .dwattr $C$DW$86, DW_AT_decl_line(0x35f)
    1505                            .dwattr $C$DW$86, DW_AT_decl_column(0x11)
    1506                    
    1507                    $C$DW$87        .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    1509                            .dwattr $C$DW$87, DW_AT_name("PRGBRST_STARTADDR")
    1510                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRGBRST_STARTADDR")
    1511                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1512                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1514                            .dwattr $C$DW$87, DW_AT_decl_line(0x360)
    1515                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   29

    1516                    
    1517                    $C$DW$88        .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1519                            .dwattr $C$DW$88, DW_AT_name("RESERVED4")
    1520                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("RESERVED4")
    1521                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1522                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1523                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1524                            .dwattr $C$DW$88, DW_AT_decl_line(0x361)
    1525                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1526                    
    1527                    $C$DW$89        .dwtag  DW_TAG_member
    1528                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    1529                            .dwattr $C$DW$89, DW_AT_name("PRGBRST_DATA0_0")
    1530                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRGBRST_DATA0_0")
    1531                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1532                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1533                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1534                            .dwattr $C$DW$89, DW_AT_decl_line(0x362)
    1535                            .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1536                    
    1537                    $C$DW$90        .dwtag  DW_TAG_member
    1538                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
    1539                            .dwattr $C$DW$90, DW_AT_name("PRGBRST_DATA0_1")
    1540                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("PRGBRST_DATA0_1")
    1541                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1542                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1543                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1544                            .dwattr $C$DW$90, DW_AT_decl_line(0x363)
    1545                            .dwattr $C$DW$90, DW_AT_decl_column(0x11)
    1546                    
    1547                    $C$DW$91        .dwtag  DW_TAG_member
    1548                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
    1549                            .dwattr $C$DW$91, DW_AT_name("PRGBRST_DATA0_2")
    1550                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRGBRST_DATA0_2")
    1551                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1552                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1553                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1554                            .dwattr $C$DW$91, DW_AT_decl_line(0x364)
    1555                            .dwattr $C$DW$91, DW_AT_decl_column(0x11)
    1556                    
    1557                    $C$DW$92        .dwtag  DW_TAG_member
    1558                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
    1559                            .dwattr $C$DW$92, DW_AT_name("PRGBRST_DATA0_3")
    1560                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRGBRST_DATA0_3")
    1561                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1562                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1563                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1564                            .dwattr $C$DW$92, DW_AT_decl_line(0x365)
    1565                            .dwattr $C$DW$92, DW_AT_decl_column(0x11)
    1566                    
    1567                    $C$DW$93        .dwtag  DW_TAG_member
    1568                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    1569                            .dwattr $C$DW$93, DW_AT_name("PRGBRST_DATA1_0")
    1570                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRGBRST_DATA1_0")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   30

    1571                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1572                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1573                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1574                            .dwattr $C$DW$93, DW_AT_decl_line(0x366)
    1575                            .dwattr $C$DW$93, DW_AT_decl_column(0x11)
    1576                    
    1577                    $C$DW$94        .dwtag  DW_TAG_member
    1578                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    1579                            .dwattr $C$DW$94, DW_AT_name("PRGBRST_DATA1_1")
    1580                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRGBRST_DATA1_1")
    1581                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1582                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1583                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1584                            .dwattr $C$DW$94, DW_AT_decl_line(0x367)
    1585                            .dwattr $C$DW$94, DW_AT_decl_column(0x11)
    1586                    
    1587                    $C$DW$95        .dwtag  DW_TAG_member
    1588                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    1589                            .dwattr $C$DW$95, DW_AT_name("PRGBRST_DATA1_2")
    1590                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRGBRST_DATA1_2")
    1591                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1592                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1593                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1594                            .dwattr $C$DW$95, DW_AT_decl_line(0x368)
    1595                            .dwattr $C$DW$95, DW_AT_decl_column(0x11)
    1596                    
    1597                    $C$DW$96        .dwtag  DW_TAG_member
    1598                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    1599                            .dwattr $C$DW$96, DW_AT_name("PRGBRST_DATA1_3")
    1600                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRGBRST_DATA1_3")
    1601                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1602                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1603                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1604                            .dwattr $C$DW$96, DW_AT_decl_line(0x369)
    1605                            .dwattr $C$DW$96, DW_AT_decl_column(0x11)
    1606                    
    1607                    $C$DW$97        .dwtag  DW_TAG_member
    1608                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1609                            .dwattr $C$DW$97, DW_AT_name("PRGBRST_DATA2_0")
    1610                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("PRGBRST_DATA2_0")
    1611                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1612                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1614                            .dwattr $C$DW$97, DW_AT_decl_line(0x36a)
    1615                            .dwattr $C$DW$97, DW_AT_decl_column(0x11)
    1616                    
    1617                    $C$DW$98        .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1619                            .dwattr $C$DW$98, DW_AT_name("PRGBRST_DATA2_1")
    1620                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("PRGBRST_DATA2_1")
    1621                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1622                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1623                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1624                            .dwattr $C$DW$98, DW_AT_decl_line(0x36b)
    1625                            .dwattr $C$DW$98, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   31

    1626                    
    1627                    $C$DW$99        .dwtag  DW_TAG_member
    1628                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1629                            .dwattr $C$DW$99, DW_AT_name("PRGBRST_DATA2_2")
    1630                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("PRGBRST_DATA2_2")
    1631                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1632                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1633                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1634                            .dwattr $C$DW$99, DW_AT_decl_line(0x36c)
    1635                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    1636                    
    1637                    $C$DW$100       .dwtag  DW_TAG_member
    1638                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    1639                            .dwattr $C$DW$100, DW_AT_name("PRGBRST_DATA2_3")
    1640                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("PRGBRST_DATA2_3")
    1641                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1642                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1643                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1644                            .dwattr $C$DW$100, DW_AT_decl_line(0x36d)
    1645                            .dwattr $C$DW$100, DW_AT_decl_column(0x11)
    1646                    
    1647                    $C$DW$101       .dwtag  DW_TAG_member
    1648                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    1649                            .dwattr $C$DW$101, DW_AT_name("PRGBRST_DATA3_0")
    1650                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRGBRST_DATA3_0")
    1651                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1652                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1653                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1654                            .dwattr $C$DW$101, DW_AT_decl_line(0x36e)
    1655                            .dwattr $C$DW$101, DW_AT_decl_column(0x11)
    1656                    
    1657                    $C$DW$102       .dwtag  DW_TAG_member
    1658                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    1659                            .dwattr $C$DW$102, DW_AT_name("PRGBRST_DATA3_1")
    1660                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("PRGBRST_DATA3_1")
    1661                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1662                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1663                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1664                            .dwattr $C$DW$102, DW_AT_decl_line(0x36f)
    1665                            .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    1666                    
    1667                    $C$DW$103       .dwtag  DW_TAG_member
    1668                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1669                            .dwattr $C$DW$103, DW_AT_name("PRGBRST_DATA3_2")
    1670                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("PRGBRST_DATA3_2")
    1671                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1672                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1673                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1674                            .dwattr $C$DW$103, DW_AT_decl_line(0x370)
    1675                            .dwattr $C$DW$103, DW_AT_decl_column(0x11)
    1676                    
    1677                    $C$DW$104       .dwtag  DW_TAG_member
    1678                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1679                            .dwattr $C$DW$104, DW_AT_name("PRGBRST_DATA3_3")
    1680                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("PRGBRST_DATA3_3")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   32

    1681                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1682                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1683                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1684                            .dwattr $C$DW$104, DW_AT_decl_line(0x371)
    1685                            .dwattr $C$DW$104, DW_AT_decl_column(0x11)
    1686                    
    1687                    $C$DW$105       .dwtag  DW_TAG_member
    1688                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    1689                            .dwattr $C$DW$105, DW_AT_name("ERASE_CTLSTAT")
    1690                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("ERASE_CTLSTAT")
    1691                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1692                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1693                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1694                            .dwattr $C$DW$105, DW_AT_decl_line(0x372)
    1695                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    1696                    
    1697                    $C$DW$106       .dwtag  DW_TAG_member
    1698                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1699                            .dwattr $C$DW$106, DW_AT_name("ERASE_SECTADDR")
    1700                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("ERASE_SECTADDR")
    1701                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1702                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1703                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1704                            .dwattr $C$DW$106, DW_AT_decl_line(0x373)
    1705                            .dwattr $C$DW$106, DW_AT_decl_column(0x11)
    1706                    
    1707                    $C$DW$107       .dwtag  DW_TAG_member
    1708                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$38)
    1709                            .dwattr $C$DW$107, DW_AT_name("RESERVED5")
    1710                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("RESERVED5")
    1711                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1712                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1713                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1714                            .dwattr $C$DW$107, DW_AT_decl_line(0x374)
    1715                            .dwattr $C$DW$107, DW_AT_decl_column(0x11)
    1716                    
    1717                    $C$DW$108       .dwtag  DW_TAG_member
    1718                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1719                            .dwattr $C$DW$108, DW_AT_name("BANK0_INFO_WEPROT")
    1720                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("BANK0_INFO_WEPROT")
    1721                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1722                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1723                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1724                            .dwattr $C$DW$108, DW_AT_decl_line(0x375)
    1725                            .dwattr $C$DW$108, DW_AT_decl_column(0x11)
    1726                    
    1727                    $C$DW$109       .dwtag  DW_TAG_member
    1728                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1729                            .dwattr $C$DW$109, DW_AT_name("BANK0_MAIN_WEPROT")
    1730                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("BANK0_MAIN_WEPROT")
    1731                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1732                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1733                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1734                            .dwattr $C$DW$109, DW_AT_decl_line(0x376)
    1735                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   33

    1736                    
    1737                    $C$DW$110       .dwtag  DW_TAG_member
    1738                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$38)
    1739                            .dwattr $C$DW$110, DW_AT_name("RESERVED6")
    1740                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("RESERVED6")
    1741                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1742                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1743                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1744                            .dwattr $C$DW$110, DW_AT_decl_line(0x377)
    1745                            .dwattr $C$DW$110, DW_AT_decl_column(0x11)
    1746                    
    1747                    $C$DW$111       .dwtag  DW_TAG_member
    1748                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    1749                            .dwattr $C$DW$111, DW_AT_name("BANK1_INFO_WEPROT")
    1750                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("BANK1_INFO_WEPROT")
    1751                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1752                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1753                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1754                            .dwattr $C$DW$111, DW_AT_decl_line(0x378)
    1755                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1756                    
    1757                    $C$DW$112       .dwtag  DW_TAG_member
    1758                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1759                            .dwattr $C$DW$112, DW_AT_name("BANK1_MAIN_WEPROT")
    1760                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("BANK1_MAIN_WEPROT")
    1761                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1762                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1763                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1764                            .dwattr $C$DW$112, DW_AT_decl_line(0x379)
    1765                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
    1766                    
    1767                    $C$DW$113       .dwtag  DW_TAG_member
    1768                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$38)
    1769                            .dwattr $C$DW$113, DW_AT_name("RESERVED7")
    1770                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("RESERVED7")
    1771                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1772                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1773                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1774                            .dwattr $C$DW$113, DW_AT_decl_line(0x37a)
    1775                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    1776                    
    1777                    $C$DW$114       .dwtag  DW_TAG_member
    1778                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1779                            .dwattr $C$DW$114, DW_AT_name("BMRK_CTLSTAT")
    1780                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("BMRK_CTLSTAT")
    1781                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1782                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1783                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1784                            .dwattr $C$DW$114, DW_AT_decl_line(0x37b)
    1785                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    1786                    
    1787                    $C$DW$115       .dwtag  DW_TAG_member
    1788                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1789                            .dwattr $C$DW$115, DW_AT_name("BMRK_IFETCH")
    1790                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("BMRK_IFETCH")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   34

    1791                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1792                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1793                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1794                            .dwattr $C$DW$115, DW_AT_decl_line(0x37c)
    1795                            .dwattr $C$DW$115, DW_AT_decl_column(0x11)
    1796                    
    1797                    $C$DW$116       .dwtag  DW_TAG_member
    1798                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1799                            .dwattr $C$DW$116, DW_AT_name("BMRK_DREAD")
    1800                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("BMRK_DREAD")
    1801                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1802                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1803                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1804                            .dwattr $C$DW$116, DW_AT_decl_line(0x37d)
    1805                            .dwattr $C$DW$116, DW_AT_decl_column(0x11)
    1806                    
    1807                    $C$DW$117       .dwtag  DW_TAG_member
    1808                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    1809                            .dwattr $C$DW$117, DW_AT_name("BMRK_CMP")
    1810                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("BMRK_CMP")
    1811                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1812                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1813                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1814                            .dwattr $C$DW$117, DW_AT_decl_line(0x37e)
    1815                            .dwattr $C$DW$117, DW_AT_decl_column(0x11)
    1816                    
    1817                    $C$DW$118       .dwtag  DW_TAG_member
    1818                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$41)
    1819                            .dwattr $C$DW$118, DW_AT_name("RESERVED8")
    1820                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("RESERVED8")
    1821                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1822                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1823                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1824                            .dwattr $C$DW$118, DW_AT_decl_line(0x37f)
    1825                            .dwattr $C$DW$118, DW_AT_decl_column(0x11)
    1826                    
    1827                    $C$DW$119       .dwtag  DW_TAG_member
    1828                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    1829                            .dwattr $C$DW$119, DW_AT_name("IFG")
    1830                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("IFG")
    1831                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1832                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1833                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1834                            .dwattr $C$DW$119, DW_AT_decl_line(0x380)
    1835                            .dwattr $C$DW$119, DW_AT_decl_column(0x11)
    1836                    
    1837                    $C$DW$120       .dwtag  DW_TAG_member
    1838                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    1839                            .dwattr $C$DW$120, DW_AT_name("IE")
    1840                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("IE")
    1841                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1842                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1843                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1844                            .dwattr $C$DW$120, DW_AT_decl_line(0x381)
    1845                            .dwattr $C$DW$120, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:43:33 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
Clock.asm                                                            PAGE   35

    1846                    
    1847                    $C$DW$121       .dwtag  DW_TAG_member
    1848                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1849                            .dwattr $C$DW$121, DW_AT_name("CLRIFG")
    1850                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("CLRIFG")
    1851                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1852                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1853                            .dwattr $C$DW$121, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1854                            .dwattr $C$DW$121, DW_AT_decl_line(0x382)
    1855                            .dwattr $C$DW$121, DW_AT_decl_column(0x11)
    1856                    
    1857                    $C$DW$122       .dwtag  DW_TAG_member
    1858                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1859                            .dwattr $C$DW$122, DW_AT_name("SETIFG")
    1860                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("SETIFG")
    1861                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1862                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1863                            .dwattr $C$DW$122, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1864                            .dwattr $C$DW$122, DW_AT_decl_line(0x383)
    1865                            .dwattr $C$DW$122, DW_AT_decl_column(0x11)
    1866                    
    1867                    $C$DW$123       .dwtag  DW_TAG_member
    1868                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    1869                            .dwattr $C$DW$123, DW_AT_name("READ_TIMCTL")
    1870                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("READ_TIMCTL")
    1871                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1872                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
