TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
       3                    ;* Date/Time created: Fri Mar 20 15:51:30 2026                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CE2007\Lab1_C_Programming\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("Clock_Delay1ms")

     844 00000140 E7FF              B         ||$C$L9||             ; [DPU_3_PIPE] |237|  ; [ORIG 16-BIT INS]
     845                            ; BRANCH OCCURS {||$C$L9||}      ; [] |237| 
     846                    ;* --------------------------------------------------------------------------*
     847                    ;* --------------------------------------------------------------------------*
     848 00000142           ||$C$L9||:    
     849                            .dwpsn  file "../main.c",line 237,column 12,is_stmt,isa 1
     850 00000142 9800              LDR       A1, [SP, #0]          ; [DPU_3_PIPE] |237|  ; [ORIG 16-BIT INS]
     851 00000144 1840              ADDS      A1, A1, A2            ; [DPU_3_PIPE] |237|  ; [ORIG 16-BIT INS]
     852 00000146 9001              STR       A1, [SP, #4]          ; [DPU_3_PIPE] |237|  ; [ORIG 16-BIT INS]
     853                            .dwpsn  file "../main.c",line 240,column 5,is_stmt,isa 1
     854 00000148 9801              LDR       A1, [SP, #4]          ; [DPU_3_PIPE] |240|  ; [ORIG 16-BIT INS]
     855                            .dwpsn  file "../main.c",line 241,column 1,is_stmt,isa 1
     856 0000014a B002              ADD       SP, SP, #8            ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     857                            .dwcfi  cfa_offset, 0
     858                    $C$DW$46        .dwtag  DW_TAG_TI_branch
     859                            .dwattr $C$DW$46, DW_AT_low_pc(0x00)
     860                            .dwattr $C$DW$46, DW_AT_TI_return
     861                    
     862 0000014c 4770              BX        LR                    ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     863                            ; BRANCH OCCURS                  ; [] 
     864                            .dwattr $C$DW$42, DW_AT_TI_end_file("../main.c")
     865                            .dwattr $C$DW$42, DW_AT_TI_end_line(0xf1)
     866                            .dwattr $C$DW$42, DW_AT_TI_end_column(0x01)
     867                            .dwendentry
     868                            .dwendtag $C$DW$42
     869                    
     870                    ;******************************************************************************
     871                    ;* CONSTANT TABLE                                                             *
     872                    ;******************************************************************************
     873 0000014e                   .sect   ".text"
     874                            .align  4
     875 0000014e 4C0C46C0  ||$C$CON2||:    .bits   1073761292,32
         00000152 00004000 
     876                            .align  4
     877 00000152 4C024000  ||$C$CON5||:    .bits   1073761282,32
         00000156 00004000 
     878                            .align  4
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     879 00000156 4C034000  ||$C$CON11||:   .bits   1073761283,32
         0000015a 00004000 
     880                            .align  4
     881 0000015a 00004000! ||$C$CON12||:   .bits   ||$P$T0$1||,32
         0000015e 00000000 
     882                    ;*****************************************************************************
     883                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     884                    ;*****************************************************************************
     885                            .global Clock_Delay1ms
     886                    
     887                    ;******************************************************************************
     888                    ;* BUILD ATTRIBUTES                                                           *
     889                    ;******************************************************************************
     890                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     891                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     892                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     893                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     894                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     895                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     896                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     897                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     898                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(3)
     899                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     900                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     901                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     902                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     903                    
     904                    ;******************************************************************************
     905                    ;* TYPE INFORMATION                                                           *
     906                    ;******************************************************************************
     907                    
     908                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     909                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
     910                    $C$DW$47        .dwtag  DW_TAG_member
     911                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
     912                            .dwattr $C$DW$47, DW_AT_name("IN")
     913                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("IN")
     914                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     916                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     917                            .dwattr $C$DW$47, DW_AT_decl_line(0x288)
     918                            .dwattr $C$DW$47, DW_AT_decl_column(0x0f)
     919                    
     920                    $C$DW$48        .dwtag  DW_TAG_member
     921                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     922                            .dwattr $C$DW$48, DW_AT_name("RESERVED0")
     923                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("RESERVED0")
     924                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     925                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     926                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     927                            .dwattr $C$DW$48, DW_AT_decl_line(0x289)
     928                            .dwattr $C$DW$48, DW_AT_decl_column(0x0b)
     929                    
     930                    $C$DW$49        .dwtag  DW_TAG_member
     931                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     932                            .dwattr $C$DW$49, DW_AT_name("OUT")
     933                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("OUT")
     934                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     935                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     936                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     937                            .dwattr $C$DW$49, DW_AT_decl_line(0x28a)
     938                            .dwattr $C$DW$49, DW_AT_decl_column(0x10)
     939                    
     940                    $C$DW$50        .dwtag  DW_TAG_member
     941                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     942                            .dwattr $C$DW$50, DW_AT_name("RESERVED1")
     943                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("RESERVED1")
     944                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     945                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     946                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     947                            .dwattr $C$DW$50, DW_AT_decl_line(0x28b)
     948                            .dwattr $C$DW$50, DW_AT_decl_column(0x0b)
     949                    
     950                    $C$DW$51        .dwtag  DW_TAG_member
     951                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     952                            .dwattr $C$DW$51, DW_AT_name("DIR")
     953                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DIR")
     954                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     955                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     956                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     957                            .dwattr $C$DW$51, DW_AT_decl_line(0x28c)
     958                            .dwattr $C$DW$51, DW_AT_decl_column(0x10)
     959                    
     960                    $C$DW$52        .dwtag  DW_TAG_member
     961                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     962                            .dwattr $C$DW$52, DW_AT_name("RESERVED2")
     963                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED2")
     964                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     965                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     966                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     967                            .dwattr $C$DW$52, DW_AT_decl_line(0x28d)
     968                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     969                    
     970                    $C$DW$53        .dwtag  DW_TAG_member
     971                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     972                            .dwattr $C$DW$53, DW_AT_name("REN")
     973                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("REN")
     974                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     975                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     976                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     977                            .dwattr $C$DW$53, DW_AT_decl_line(0x28e)
     978                            .dwattr $C$DW$53, DW_AT_decl_column(0x10)
     979                    
     980                    $C$DW$54        .dwtag  DW_TAG_member
     981                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     982                            .dwattr $C$DW$54, DW_AT_name("RESERVED3")
     983                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED3")
     984                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     985                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     986                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     987                            .dwattr $C$DW$54, DW_AT_decl_line(0x28f)
     988                            .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
     989                    
     990                    $C$DW$55        .dwtag  DW_TAG_member
     991                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     992                            .dwattr $C$DW$55, DW_AT_name("DS")
     993                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("DS")
     994                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     995                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     996                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     997                            .dwattr $C$DW$55, DW_AT_decl_line(0x290)
     998                            .dwattr $C$DW$55, DW_AT_decl_column(0x10)
     999                    
    1000                    $C$DW$56        .dwtag  DW_TAG_member
    1001                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1002                            .dwattr $C$DW$56, DW_AT_name("RESERVED4")
    1003                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED4")
    1004                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1005                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1006                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1007                            .dwattr $C$DW$56, DW_AT_decl_line(0x291)
    1008                            .dwattr $C$DW$56, DW_AT_decl_column(0x0b)
    1009                    
    1010                    $C$DW$57        .dwtag  DW_TAG_member
    1011                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
    1012                            .dwattr $C$DW$57, DW_AT_name("SEL0")
    1013                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("SEL0")
    1014                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1015                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1016                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1017                            .dwattr $C$DW$57, DW_AT_decl_line(0x292)
    1018                            .dwattr $C$DW$57, DW_AT_decl_column(0x10)
    1019                    
    1020                    $C$DW$58        .dwtag  DW_TAG_member
    1021                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1022                            .dwattr $C$DW$58, DW_AT_name("RESERVED5")
    1023                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("RESERVED5")
    1024                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1025                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1026                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1027                            .dwattr $C$DW$58, DW_AT_decl_line(0x293)
    1028                            .dwattr $C$DW$58, DW_AT_decl_column(0x0b)
    1029                    
    1030                    $C$DW$59        .dwtag  DW_TAG_member
    1031                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
    1032                            .dwattr $C$DW$59, DW_AT_name("SEL1")
    1033                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("SEL1")
    1034                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1035                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1036                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1037                            .dwattr $C$DW$59, DW_AT_decl_line(0x294)
    1038                            .dwattr $C$DW$59, DW_AT_decl_column(0x10)
    1039                    
    1040                    $C$DW$60        .dwtag  DW_TAG_member
    1041                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   20

    1042                            .dwattr $C$DW$60, DW_AT_name("RESERVED6")
    1043                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("RESERVED6")
    1044                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1045                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1046                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1047                            .dwattr $C$DW$60, DW_AT_decl_line(0x295)
    1048                            .dwattr $C$DW$60, DW_AT_decl_column(0x0b)
    1049                    
    1050                    $C$DW$61        .dwtag  DW_TAG_member
    1051                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$23)
    1052                            .dwattr $C$DW$61, DW_AT_name("IV")
    1053                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("IV")
    1054                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1055                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1056                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1057                            .dwattr $C$DW$61, DW_AT_decl_line(0x296)
    1058                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1059                    
    1060                    $C$DW$62        .dwtag  DW_TAG_member
    1061                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$24)
    1062                            .dwattr $C$DW$62, DW_AT_name("RESERVED7")
    1063                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED7")
    1064                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1065                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1066                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1067                            .dwattr $C$DW$62, DW_AT_decl_line(0x297)
    1068                            .dwattr $C$DW$62, DW_AT_decl_column(0x0b)
    1069                    
    1070                    $C$DW$63        .dwtag  DW_TAG_member
    1071                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
    1072                            .dwattr $C$DW$63, DW_AT_name("SELC")
    1073                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SELC")
    1074                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1075                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1076                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1077                            .dwattr $C$DW$63, DW_AT_decl_line(0x298)
    1078                            .dwattr $C$DW$63, DW_AT_decl_column(0x10)
    1079                    
    1080                    $C$DW$64        .dwtag  DW_TAG_member
    1081                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1082                            .dwattr $C$DW$64, DW_AT_name("RESERVED8")
    1083                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED8")
    1084                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1085                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1086                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1087                            .dwattr $C$DW$64, DW_AT_decl_line(0x299)
    1088                            .dwattr $C$DW$64, DW_AT_decl_column(0x0b)
    1089                    
    1090                    $C$DW$65        .dwtag  DW_TAG_member
    1091                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
    1092                            .dwattr $C$DW$65, DW_AT_name("IES")
    1093                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("IES")
    1094                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1095                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1096                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1097                            .dwattr $C$DW$65, DW_AT_decl_line(0x29a)
    1098                            .dwattr $C$DW$65, DW_AT_decl_column(0x10)
    1099                    
    1100                    $C$DW$66        .dwtag  DW_TAG_member
    1101                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1102                            .dwattr $C$DW$66, DW_AT_name("RESERVED9")
    1103                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("RESERVED9")
    1104                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1105                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1106                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1107                            .dwattr $C$DW$66, DW_AT_decl_line(0x29b)
    1108                            .dwattr $C$DW$66, DW_AT_decl_column(0x0b)
    1109                    
    1110                    $C$DW$67        .dwtag  DW_TAG_member
    1111                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
    1112                            .dwattr $C$DW$67, DW_AT_name("IE")
    1113                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("IE")
    1114                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1115                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1116                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1117                            .dwattr $C$DW$67, DW_AT_decl_line(0x29c)
    1118                            .dwattr $C$DW$67, DW_AT_decl_column(0x10)
    1119                    
    1120                    $C$DW$68        .dwtag  DW_TAG_member
    1121                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1122                            .dwattr $C$DW$68, DW_AT_name("RESERVED10")
    1123                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("RESERVED10")
    1124                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1125                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1126                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1127                            .dwattr $C$DW$68, DW_AT_decl_line(0x29d)
    1128                            .dwattr $C$DW$68, DW_AT_decl_column(0x0b)
    1129                    
    1130                    $C$DW$69        .dwtag  DW_TAG_member
    1131                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
    1132                            .dwattr $C$DW$69, DW_AT_name("IFG")
    1133                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("IFG")
    1134                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1135                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1136                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1137                            .dwattr $C$DW$69, DW_AT_decl_line(0x29e)
    1138                            .dwattr $C$DW$69, DW_AT_decl_column(0x10)
    1139                    
    1140                    $C$DW$70        .dwtag  DW_TAG_member
    1141                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1142                            .dwattr $C$DW$70, DW_AT_name("RESERVED11")
    1143                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("RESERVED11")
    1144                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1145                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1146                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1147                            .dwattr $C$DW$70, DW_AT_decl_line(0x29f)
    1148                            .dwattr $C$DW$70, DW_AT_decl_column(0x0b)
    1149                    
    1150                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1151                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x287)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1152                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1153                            .dwendtag $C$DW$T$25
    1154                    
    1155                    $C$DW$T$172     .dwtag  DW_TAG_typedef
    1156                            .dwattr $C$DW$T$172, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    1157                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$25)
    1158                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    1159                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1160                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x2a0)
    1161                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
    1162                    
    1163                    
    1164                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1165                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
    1166                    $C$DW$71        .dwtag  DW_TAG_member
    1167                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1168                            .dwattr $C$DW$71, DW_AT_name("RESERVED0")
    1169                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED0")
    1170                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1172                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1173                            .dwattr $C$DW$71, DW_AT_decl_line(0x2a3)
    1174                            .dwattr $C$DW$71, DW_AT_decl_column(0x0b)
    1175                    
    1176                    $C$DW$72        .dwtag  DW_TAG_member
    1177                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
    1178                            .dwattr $C$DW$72, DW_AT_name("IN")
    1179                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("IN")
    1180                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1181                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1182                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1183                            .dwattr $C$DW$72, DW_AT_decl_line(0x2a4)
    1184                            .dwattr $C$DW$72, DW_AT_decl_column(0x0f)
    1185                    
    1186                    $C$DW$73        .dwtag  DW_TAG_member
    1187                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1188                            .dwattr $C$DW$73, DW_AT_name("RESERVED1")
    1189                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED1")
    1190                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1191                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1192                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1193                            .dwattr $C$DW$73, DW_AT_decl_line(0x2a5)
    1194                            .dwattr $C$DW$73, DW_AT_decl_column(0x0b)
    1195                    
    1196                    $C$DW$74        .dwtag  DW_TAG_member
    1197                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1198                            .dwattr $C$DW$74, DW_AT_name("OUT")
    1199                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("OUT")
    1200                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1201                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1202                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1203                            .dwattr $C$DW$74, DW_AT_decl_line(0x2a6)
    1204                            .dwattr $C$DW$74, DW_AT_decl_column(0x10)
    1205                    
    1206                    $C$DW$75        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1207                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1208                            .dwattr $C$DW$75, DW_AT_name("RESERVED2")
    1209                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED2")
    1210                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1211                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1212                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1213                            .dwattr $C$DW$75, DW_AT_decl_line(0x2a7)
    1214                            .dwattr $C$DW$75, DW_AT_decl_column(0x0b)
    1215                    
    1216                    $C$DW$76        .dwtag  DW_TAG_member
    1217                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
    1218                            .dwattr $C$DW$76, DW_AT_name("DIR")
    1219                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("DIR")
    1220                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1221                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1222                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1223                            .dwattr $C$DW$76, DW_AT_decl_line(0x2a8)
    1224                            .dwattr $C$DW$76, DW_AT_decl_column(0x10)
    1225                    
    1226                    $C$DW$77        .dwtag  DW_TAG_member
    1227                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1228                            .dwattr $C$DW$77, DW_AT_name("RESERVED3")
    1229                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED3")
    1230                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1231                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1232                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1233                            .dwattr $C$DW$77, DW_AT_decl_line(0x2a9)
    1234                            .dwattr $C$DW$77, DW_AT_decl_column(0x0b)
    1235                    
    1236                    $C$DW$78        .dwtag  DW_TAG_member
    1237                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
    1238                            .dwattr $C$DW$78, DW_AT_name("REN")
    1239                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("REN")
    1240                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1241                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1242                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1243                            .dwattr $C$DW$78, DW_AT_decl_line(0x2aa)
    1244                            .dwattr $C$DW$78, DW_AT_decl_column(0x10)
    1245                    
    1246                    $C$DW$79        .dwtag  DW_TAG_member
    1247                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1248                            .dwattr $C$DW$79, DW_AT_name("RESERVED4")
    1249                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED4")
    1250                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1251                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1252                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1253                            .dwattr $C$DW$79, DW_AT_decl_line(0x2ab)
    1254                            .dwattr $C$DW$79, DW_AT_decl_column(0x0b)
    1255                    
    1256                    $C$DW$80        .dwtag  DW_TAG_member
    1257                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1258                            .dwattr $C$DW$80, DW_AT_name("DS")
    1259                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("DS")
    1260                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1261                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1262                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1263                            .dwattr $C$DW$80, DW_AT_decl_line(0x2ac)
    1264                            .dwattr $C$DW$80, DW_AT_decl_column(0x10)
    1265                    
    1266                    $C$DW$81        .dwtag  DW_TAG_member
    1267                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1268                            .dwattr $C$DW$81, DW_AT_name("RESERVED5")
    1269                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED5")
    1270                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1271                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1272                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1273                            .dwattr $C$DW$81, DW_AT_decl_line(0x2ad)
    1274                            .dwattr $C$DW$81, DW_AT_decl_column(0x0b)
    1275                    
    1276                    $C$DW$82        .dwtag  DW_TAG_member
    1277                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1278                            .dwattr $C$DW$82, DW_AT_name("SEL0")
    1279                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("SEL0")
    1280                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1281                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1282                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1283                            .dwattr $C$DW$82, DW_AT_decl_line(0x2ae)
    1284                            .dwattr $C$DW$82, DW_AT_decl_column(0x10)
    1285                    
    1286                    $C$DW$83        .dwtag  DW_TAG_member
    1287                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1288                            .dwattr $C$DW$83, DW_AT_name("RESERVED6")
    1289                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED6")
    1290                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1291                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1292                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1293                            .dwattr $C$DW$83, DW_AT_decl_line(0x2af)
    1294                            .dwattr $C$DW$83, DW_AT_decl_column(0x0b)
    1295                    
    1296                    $C$DW$84        .dwtag  DW_TAG_member
    1297                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1298                            .dwattr $C$DW$84, DW_AT_name("SEL1")
    1299                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("SEL1")
    1300                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1301                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1302                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1303                            .dwattr $C$DW$84, DW_AT_decl_line(0x2b0)
    1304                            .dwattr $C$DW$84, DW_AT_decl_column(0x10)
    1305                    
    1306                    $C$DW$85        .dwtag  DW_TAG_member
    1307                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$26)
    1308                            .dwattr $C$DW$85, DW_AT_name("RESERVED7")
    1309                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED7")
    1310                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1311                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1312                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1313                            .dwattr $C$DW$85, DW_AT_decl_line(0x2b1)
    1314                            .dwattr $C$DW$85, DW_AT_decl_column(0x0b)
    1315                    
    1316                    $C$DW$86        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1317                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1318                            .dwattr $C$DW$86, DW_AT_name("SELC")
    1319                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("SELC")
    1320                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1321                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1322                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1323                            .dwattr $C$DW$86, DW_AT_decl_line(0x2b2)
    1324                            .dwattr $C$DW$86, DW_AT_decl_column(0x10)
    1325                    
    1326                    $C$DW$87        .dwtag  DW_TAG_member
    1327                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1328                            .dwattr $C$DW$87, DW_AT_name("RESERVED8")
    1329                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("RESERVED8")
    1330                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1331                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1332                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1333                            .dwattr $C$DW$87, DW_AT_decl_line(0x2b3)
    1334                            .dwattr $C$DW$87, DW_AT_decl_column(0x0b)
    1335                    
    1336                    $C$DW$88        .dwtag  DW_TAG_member
    1337                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1338                            .dwattr $C$DW$88, DW_AT_name("IES")
    1339                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("IES")
    1340                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1341                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1342                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1343                            .dwattr $C$DW$88, DW_AT_decl_line(0x2b4)
    1344                            .dwattr $C$DW$88, DW_AT_decl_column(0x10)
    1345                    
    1346                    $C$DW$89        .dwtag  DW_TAG_member
    1347                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1348                            .dwattr $C$DW$89, DW_AT_name("RESERVED9")
    1349                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("RESERVED9")
    1350                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1351                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1352                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1353                            .dwattr $C$DW$89, DW_AT_decl_line(0x2b5)
    1354                            .dwattr $C$DW$89, DW_AT_decl_column(0x0b)
    1355                    
    1356                    $C$DW$90        .dwtag  DW_TAG_member
    1357                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1358                            .dwattr $C$DW$90, DW_AT_name("IE")
    1359                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("IE")
    1360                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1361                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1362                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1363                            .dwattr $C$DW$90, DW_AT_decl_line(0x2b6)
    1364                            .dwattr $C$DW$90, DW_AT_decl_column(0x10)
    1365                    
    1366                    $C$DW$91        .dwtag  DW_TAG_member
    1367                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1368                            .dwattr $C$DW$91, DW_AT_name("RESERVED10")
    1369                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("RESERVED10")
    1370                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1371                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1372                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1373                            .dwattr $C$DW$91, DW_AT_decl_line(0x2b7)
    1374                            .dwattr $C$DW$91, DW_AT_decl_column(0x0b)
    1375                    
    1376                    $C$DW$92        .dwtag  DW_TAG_member
    1377                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1378                            .dwattr $C$DW$92, DW_AT_name("IFG")
    1379                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("IFG")
    1380                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1381                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1382                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1383                            .dwattr $C$DW$92, DW_AT_decl_line(0x2b8)
    1384                            .dwattr $C$DW$92, DW_AT_decl_column(0x10)
    1385                    
    1386                    $C$DW$93        .dwtag  DW_TAG_member
    1387                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$23)
    1388                            .dwattr $C$DW$93, DW_AT_name("IV")
    1389                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("IV")
    1390                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1391                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1392                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1393                            .dwattr $C$DW$93, DW_AT_decl_line(0x2b9)
    1394                            .dwattr $C$DW$93, DW_AT_decl_column(0x10)
    1395                    
    1396                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1397                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2a2)
    1398                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1399                            .dwendtag $C$DW$T$27
    1400                    
    1401                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1402                            .dwattr $C$DW$T$174, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    1403                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$27)
    1404                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1405                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1406                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x2ba)
    1407                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x03)
    1408                    
    1409                    
    1410                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1411                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1412                    $C$DW$94        .dwtag  DW_TAG_member
    1413                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$28)
    1414                            .dwattr $C$DW$94, DW_AT_name("_reserved0")
    1415                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("_reserved0")
    1416                            .dwattr $C$DW$94, DW_AT_bit_offset(0x10)
    1417                            .dwattr $C$DW$94, DW_AT_bit_size(0x10)
    1418                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1420                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1421                            .dwattr $C$DW$94, DW_AT_decl_line(0x105)
    1422                            .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1423                    
    1424                    $C$DW$95        .dwtag  DW_TAG_member
    1425                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$28)
    1426                            .dwattr $C$DW$95, DW_AT_name("GE")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1427                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("GE")
    1428                            .dwattr $C$DW$95, DW_AT_bit_offset(0x0c)
    1429                            .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1430                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1432                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1433                            .dwattr $C$DW$95, DW_AT_decl_line(0x106)
    1434                            .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1435                    
    1436                    $C$DW$96        .dwtag  DW_TAG_member
    1437                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    1438                            .dwattr $C$DW$96, DW_AT_name("_reserved1")
    1439                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("_reserved1")
    1440                            .dwattr $C$DW$96, DW_AT_bit_offset(0x05)
    1441                            .dwattr $C$DW$96, DW_AT_bit_size(0x07)
    1442                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1444                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1445                            .dwattr $C$DW$96, DW_AT_decl_line(0x107)
    1446                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1447                    
    1448                    $C$DW$97        .dwtag  DW_TAG_member
    1449                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
    1450                            .dwattr $C$DW$97, DW_AT_name("Q")
    1451                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("Q")
    1452                            .dwattr $C$DW$97, DW_AT_bit_offset(0x04)
    1453                            .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1454                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1456                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1457                            .dwattr $C$DW$97, DW_AT_decl_line(0x108)
    1458                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1459                    
    1460                    $C$DW$98        .dwtag  DW_TAG_member
    1461                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$28)
    1462                            .dwattr $C$DW$98, DW_AT_name("V")
    1463                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("V")
    1464                            .dwattr $C$DW$98, DW_AT_bit_offset(0x03)
    1465                            .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1466                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1468                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1469                            .dwattr $C$DW$98, DW_AT_decl_line(0x109)
    1470                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1471                    
    1472                    $C$DW$99        .dwtag  DW_TAG_member
    1473                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    1474                            .dwattr $C$DW$99, DW_AT_name("C")
    1475                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("C")
    1476                            .dwattr $C$DW$99, DW_AT_bit_offset(0x02)
    1477                            .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1478                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1480                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1481                            .dwattr $C$DW$99, DW_AT_decl_line(0x10a)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1482                            .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1483                    
    1484                    $C$DW$100       .dwtag  DW_TAG_member
    1485                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
    1486                            .dwattr $C$DW$100, DW_AT_name("Z")
    1487                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("Z")
    1488                            .dwattr $C$DW$100, DW_AT_bit_offset(0x01)
    1489                            .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1490                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1492                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1493                            .dwattr $C$DW$100, DW_AT_decl_line(0x10b)
    1494                            .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1495                    
    1496                    $C$DW$101       .dwtag  DW_TAG_member
    1497                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$28)
    1498                            .dwattr $C$DW$101, DW_AT_name("N")
    1499                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("N")
    1500                            .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1501                            .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1502                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1504                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1505                            .dwattr $C$DW$101, DW_AT_decl_line(0x10c)
    1506                            .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1507                    
    1508                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1509                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x104)
    1510                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    1511                            .dwendtag $C$DW$T$29
    1512                    
    1513                    
    1514                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1515                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1516                    $C$DW$102       .dwtag  DW_TAG_member
    1517                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$28)
    1518                            .dwattr $C$DW$102, DW_AT_name("ISR")
    1519                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("ISR")
    1520                            .dwattr $C$DW$102, DW_AT_bit_offset(0x17)
    1521                            .dwattr $C$DW$102, DW_AT_bit_size(0x09)
    1522                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1524                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1525                            .dwattr $C$DW$102, DW_AT_decl_line(0x12c)
    1526                            .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1527                    
    1528                    $C$DW$103       .dwtag  DW_TAG_member
    1529                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    1530                            .dwattr $C$DW$103, DW_AT_name("_reserved0")
    1531                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("_reserved0")
    1532                            .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1533                            .dwattr $C$DW$103, DW_AT_bit_size(0x17)
    1534                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1536                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1537                            .dwattr $C$DW$103, DW_AT_decl_line(0x12d)
    1538                            .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1539                    
    1540                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1541                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x12b)
    1542                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    1543                            .dwendtag $C$DW$T$30
    1544                    
    1545                    
    1546                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1547                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1548                    $C$DW$104       .dwtag  DW_TAG_member
    1549                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$28)
    1550                            .dwattr $C$DW$104, DW_AT_name("ISR")
    1551                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("ISR")
    1552                            .dwattr $C$DW$104, DW_AT_bit_offset(0x17)
    1553                            .dwattr $C$DW$104, DW_AT_bit_size(0x09)
    1554                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1556                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1557                            .dwattr $C$DW$104, DW_AT_decl_line(0x13e)
    1558                            .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1559                    
    1560                    $C$DW$105       .dwtag  DW_TAG_member
    1561                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1562                            .dwattr $C$DW$105, DW_AT_name("_reserved0")
    1563                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("_reserved0")
    1564                            .dwattr $C$DW$105, DW_AT_bit_offset(0x16)
    1565                            .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1566                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1568                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1569                            .dwattr $C$DW$105, DW_AT_decl_line(0x13f)
    1570                            .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1571                    
    1572                    $C$DW$106       .dwtag  DW_TAG_member
    1573                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$28)
    1574                            .dwattr $C$DW$106, DW_AT_name("ICI_IT_1")
    1575                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("ICI_IT_1")
    1576                            .dwattr $C$DW$106, DW_AT_bit_offset(0x10)
    1577                            .dwattr $C$DW$106, DW_AT_bit_size(0x06)
    1578                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1579                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1580                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1581                            .dwattr $C$DW$106, DW_AT_decl_line(0x140)
    1582                            .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1583                    
    1584                    $C$DW$107       .dwtag  DW_TAG_member
    1585                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$28)
    1586                            .dwattr $C$DW$107, DW_AT_name("GE")
    1587                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("GE")
    1588                            .dwattr $C$DW$107, DW_AT_bit_offset(0x0c)
    1589                            .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1590                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1592                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1593                            .dwattr $C$DW$107, DW_AT_decl_line(0x141)
    1594                            .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1595                    
    1596                    $C$DW$108       .dwtag  DW_TAG_member
    1597                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    1598                            .dwattr $C$DW$108, DW_AT_name("_reserved1")
    1599                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("_reserved1")
    1600                            .dwattr $C$DW$108, DW_AT_bit_offset(0x08)
    1601                            .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1602                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1604                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1605                            .dwattr $C$DW$108, DW_AT_decl_line(0x142)
    1606                            .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1607                    
    1608                    $C$DW$109       .dwtag  DW_TAG_member
    1609                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$28)
    1610                            .dwattr $C$DW$109, DW_AT_name("T")
    1611                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("T")
    1612                            .dwattr $C$DW$109, DW_AT_bit_offset(0x07)
    1613                            .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1614                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1615                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1616                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1617                            .dwattr $C$DW$109, DW_AT_decl_line(0x143)
    1618                            .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1619                    
    1620                    $C$DW$110       .dwtag  DW_TAG_member
    1621                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$28)
    1622                            .dwattr $C$DW$110, DW_AT_name("ICI_IT_2")
    1623                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("ICI_IT_2")
    1624                            .dwattr $C$DW$110, DW_AT_bit_offset(0x05)
    1625                            .dwattr $C$DW$110, DW_AT_bit_size(0x02)
    1626                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1628                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1629                            .dwattr $C$DW$110, DW_AT_decl_line(0x144)
    1630                            .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1631                    
    1632                    $C$DW$111       .dwtag  DW_TAG_member
    1633                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$28)
    1634                            .dwattr $C$DW$111, DW_AT_name("Q")
    1635                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("Q")
    1636                            .dwattr $C$DW$111, DW_AT_bit_offset(0x04)
    1637                            .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1638                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1639                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1640                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1641                            .dwattr $C$DW$111, DW_AT_decl_line(0x145)
    1642                            .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    1643                    
    1644                    $C$DW$112       .dwtag  DW_TAG_member
    1645                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$28)
    1646                            .dwattr $C$DW$112, DW_AT_name("V")
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1647                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("V")
    1648                            .dwattr $C$DW$112, DW_AT_bit_offset(0x03)
    1649                            .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1650                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1652                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1653                            .dwattr $C$DW$112, DW_AT_decl_line(0x146)
    1654                            .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    1655                    
    1656                    $C$DW$113       .dwtag  DW_TAG_member
    1657                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$28)
    1658                            .dwattr $C$DW$113, DW_AT_name("C")
    1659                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("C")
    1660                            .dwattr $C$DW$113, DW_AT_bit_offset(0x02)
    1661                            .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1662                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1664                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1665                            .dwattr $C$DW$113, DW_AT_decl_line(0x147)
    1666                            .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1667                    
    1668                    $C$DW$114       .dwtag  DW_TAG_member
    1669                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$28)
    1670                            .dwattr $C$DW$114, DW_AT_name("Z")
    1671                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("Z")
    1672                            .dwattr $C$DW$114, DW_AT_bit_offset(0x01)
    1673                            .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1674                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1676                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1677                            .dwattr $C$DW$114, DW_AT_decl_line(0x148)
    1678                            .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1679                    
    1680                    $C$DW$115       .dwtag  DW_TAG_member
    1681                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$28)
    1682                            .dwattr $C$DW$115, DW_AT_name("N")
    1683                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("N")
    1684                            .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1685                            .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1686                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1688                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1689                            .dwattr $C$DW$115, DW_AT_decl_line(0x149)
    1690                            .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1691                    
    1692                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1693                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x13d)
    1694                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    1695                            .dwendtag $C$DW$T$31
    1696                    
    1697                    
    1698                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1699                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    1700                    $C$DW$116       .dwtag  DW_TAG_member
    1701                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$28)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1702                            .dwattr $C$DW$116, DW_AT_name("nPRIV")
    1703                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("nPRIV")
    1704                            .dwattr $C$DW$116, DW_AT_bit_offset(0x1f)
    1705                            .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1706                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1708                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1709                            .dwattr $C$DW$116, DW_AT_decl_line(0x175)
    1710                            .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    1711                    
    1712                    $C$DW$117       .dwtag  DW_TAG_member
    1713                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$28)
    1714                            .dwattr $C$DW$117, DW_AT_name("SPSEL")
    1715                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("SPSEL")
    1716                            .dwattr $C$DW$117, DW_AT_bit_offset(0x1e)
    1717                            .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1718                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1719                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1720                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1721                            .dwattr $C$DW$117, DW_AT_decl_line(0x176)
    1722                            .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1723                    
    1724                    $C$DW$118       .dwtag  DW_TAG_member
    1725                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$28)
    1726                            .dwattr $C$DW$118, DW_AT_name("FPCA")
    1727                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("FPCA")
    1728                            .dwattr $C$DW$118, DW_AT_bit_offset(0x1d)
    1729                            .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1730                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1732                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1733                            .dwattr $C$DW$118, DW_AT_decl_line(0x177)
    1734                            .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1735                    
    1736                    $C$DW$119       .dwtag  DW_TAG_member
    1737                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$28)
    1738                            .dwattr $C$DW$119, DW_AT_name("_reserved0")
    1739                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("_reserved0")
    1740                            .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1741                            .dwattr $C$DW$119, DW_AT_bit_size(0x1d)
    1742                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1744                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1745                            .dwattr $C$DW$119, DW_AT_decl_line(0x178)
    1746                            .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    1747                    
    1748                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1749                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x174)
    1750                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1751                            .dwendtag $C$DW$T$32
    1752                    
    1753                    
    1754                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1755                            .dwattr $C$DW$T$39, DW_AT_byte_size(0xe04)
    1756                    $C$DW$120       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1757                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$34)
    1758                            .dwattr $C$DW$120, DW_AT_name("ISER")
    1759                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("ISER")
    1760                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1761                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1762                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1763                            .dwattr $C$DW$120, DW_AT_decl_line(0x196)
    1764                            .dwattr $C$DW$120, DW_AT_decl_column(0x12)
    1765                    
    1766                    $C$DW$121       .dwtag  DW_TAG_member
    1767                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$35)
    1768                            .dwattr $C$DW$121, DW_AT_name("RESERVED0")
    1769                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("RESERVED0")
    1770                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1771                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1772                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1773                            .dwattr $C$DW$121, DW_AT_decl_line(0x197)
    1774                            .dwattr $C$DW$121, DW_AT_decl_column(0x12)
    1775                    
    1776                    $C$DW$122       .dwtag  DW_TAG_member
    1777                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$34)
    1778                            .dwattr $C$DW$122, DW_AT_name("ICER")
    1779                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("ICER")
    1780                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1781                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1782                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1783                            .dwattr $C$DW$122, DW_AT_decl_line(0x198)
    1784                            .dwattr $C$DW$122, DW_AT_decl_column(0x12)
    1785                    
    1786                    $C$DW$123       .dwtag  DW_TAG_member
    1787                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$35)
    1788                            .dwattr $C$DW$123, DW_AT_name("RSERVED1")
    1789                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("RSERVED1")
    1790                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1791                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1792                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1793                            .dwattr $C$DW$123, DW_AT_decl_line(0x199)
    1794                            .dwattr $C$DW$123, DW_AT_decl_column(0x12)
    1795                    
    1796                    $C$DW$124       .dwtag  DW_TAG_member
    1797                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$34)
    1798                            .dwattr $C$DW$124, DW_AT_name("ISPR")
    1799                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("ISPR")
    1800                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1801                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1802                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1803                            .dwattr $C$DW$124, DW_AT_decl_line(0x19a)
    1804                            .dwattr $C$DW$124, DW_AT_decl_column(0x12)
    1805                    
    1806                    $C$DW$125       .dwtag  DW_TAG_member
    1807                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$35)
    1808                            .dwattr $C$DW$125, DW_AT_name("RESERVED2")
    1809                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("RESERVED2")
    1810                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1811                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1812                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1813                            .dwattr $C$DW$125, DW_AT_decl_line(0x19b)
    1814                            .dwattr $C$DW$125, DW_AT_decl_column(0x12)
    1815                    
    1816                    $C$DW$126       .dwtag  DW_TAG_member
    1817                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$34)
    1818                            .dwattr $C$DW$126, DW_AT_name("ICPR")
    1819                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("ICPR")
    1820                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1821                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1822                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1823                            .dwattr $C$DW$126, DW_AT_decl_line(0x19c)
    1824                            .dwattr $C$DW$126, DW_AT_decl_column(0x12)
    1825                    
    1826                    $C$DW$127       .dwtag  DW_TAG_member
    1827                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$35)
    1828                            .dwattr $C$DW$127, DW_AT_name("RESERVED3")
    1829                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("RESERVED3")
    1830                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1831                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1832                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1833                            .dwattr $C$DW$127, DW_AT_decl_line(0x19d)
    1834                            .dwattr $C$DW$127, DW_AT_decl_column(0x12)
    1835                    
    1836                    $C$DW$128       .dwtag  DW_TAG_member
    1837                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$34)
    1838                            .dwattr $C$DW$128, DW_AT_name("IABR")
    1839                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("IABR")
    1840                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1841                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1842                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1843                            .dwattr $C$DW$128, DW_AT_decl_line(0x19e)
    1844                            .dwattr $C$DW$128, DW_AT_decl_column(0x12)
    1845                    
    1846                    $C$DW$129       .dwtag  DW_TAG_member
    1847                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$36)
    1848                            .dwattr $C$DW$129, DW_AT_name("RESERVED4")
    1849                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("RESERVED4")
    1850                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1851                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1852                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1853                            .dwattr $C$DW$129, DW_AT_decl_line(0x19f)
    1854                            .dwattr $C$DW$129, DW_AT_decl_column(0x12)
    1855                    
    1856                    $C$DW$130       .dwtag  DW_TAG_member
    1857                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$37)
    1858                            .dwattr $C$DW$130, DW_AT_name("IP")
    1859                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("IP")
    1860                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1861                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1862                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1863                            .dwattr $C$DW$130, DW_AT_decl_line(0x1a0)
    1864                            .dwattr $C$DW$130, DW_AT_decl_column(0x12)
    1865                    
    1866                    $C$DW$131       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1867                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$38)
    1868                            .dwattr $C$DW$131, DW_AT_name("RESERVED5")
    1869                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("RESERVED5")
    1870                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1871                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1872                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1873                            .dwattr $C$DW$131, DW_AT_decl_line(0x1a1)
    1874                            .dwattr $C$DW$131, DW_AT_decl_column(0x12)
    1875                    
    1876                    $C$DW$132       .dwtag  DW_TAG_member
    1877                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$33)
    1878                            .dwattr $C$DW$132, DW_AT_name("STIR")
    1879                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("STIR")
    1880                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1881                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1882                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1883                            .dwattr $C$DW$132, DW_AT_decl_line(0x1a2)
    1884                            .dwattr $C$DW$132, DW_AT_decl_column(0x12)
    1885                    
    1886                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1887                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x195)
    1888                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    1889                            .dwendtag $C$DW$T$39
    1890                    
    1891                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    1892                            .dwattr $C$DW$T$176, DW_AT_name("NVIC_Type")
    1893                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$39)
    1894                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    1895                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1896                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x1a3)
    1897                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x04)
    1898                    
    1899                    
    1900                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1901                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x8c)
    1902                    $C$DW$133       .dwtag  DW_TAG_member
    1903                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$40)
    1904                            .dwattr $C$DW$133, DW_AT_name("CPUID")
    1905                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("CPUID")
    1906                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1908                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1909                            .dwattr $C$DW$133, DW_AT_decl_line(0x1b8)
    1910                            .dwattr $C$DW$133, DW_AT_decl_column(0x12)
    1911                    
    1912                    $C$DW$134       .dwtag  DW_TAG_member
    1913                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$33)
    1914                            .dwattr $C$DW$134, DW_AT_name("ICSR")
    1915                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ICSR")
    1916                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1917                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1918                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1919                            .dwattr $C$DW$134, DW_AT_decl_line(0x1b9)
    1920                            .dwattr $C$DW$134, DW_AT_decl_column(0x12)
    1921                    
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1922                    $C$DW$135       .dwtag  DW_TAG_member
    1923                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$33)
    1924                            .dwattr $C$DW$135, DW_AT_name("VTOR")
    1925                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("VTOR")
    1926                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1927                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1928                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1929                            .dwattr $C$DW$135, DW_AT_decl_line(0x1ba)
    1930                            .dwattr $C$DW$135, DW_AT_decl_column(0x12)
    1931                    
    1932                    $C$DW$136       .dwtag  DW_TAG_member
    1933                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$33)
    1934                            .dwattr $C$DW$136, DW_AT_name("AIRCR")
    1935                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("AIRCR")
    1936                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1937                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1938                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1939                            .dwattr $C$DW$136, DW_AT_decl_line(0x1bb)
    1940                            .dwattr $C$DW$136, DW_AT_decl_column(0x12)
    1941                    
    1942                    $C$DW$137       .dwtag  DW_TAG_member
    1943                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$33)
    1944                            .dwattr $C$DW$137, DW_AT_name("SCR")
    1945                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("SCR")
    1946                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1947                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1948                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1949                            .dwattr $C$DW$137, DW_AT_decl_line(0x1bc)
    1950                            .dwattr $C$DW$137, DW_AT_decl_column(0x12)
    1951                    
    1952                    $C$DW$138       .dwtag  DW_TAG_member
    1953                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$33)
    1954                            .dwattr $C$DW$138, DW_AT_name("CCR")
    1955                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("CCR")
    1956                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1957                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1958                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1959                            .dwattr $C$DW$138, DW_AT_decl_line(0x1bd)
    1960                            .dwattr $C$DW$138, DW_AT_decl_column(0x12)
    1961                    
    1962                    $C$DW$139       .dwtag  DW_TAG_member
    1963                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$41)
    1964                            .dwattr $C$DW$139, DW_AT_name("SHP")
    1965                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("SHP")
    1966                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1967                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1968                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1969                            .dwattr $C$DW$139, DW_AT_decl_line(0x1be)
    1970                            .dwattr $C$DW$139, DW_AT_decl_column(0x12)
    1971                    
    1972                    $C$DW$140       .dwtag  DW_TAG_member
    1973                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$33)
    1974                            .dwattr $C$DW$140, DW_AT_name("SHCSR")
    1975                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("SHCSR")
    1976                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TI ARM Assembler PC v16.9.6 Fri Mar 20 15:51:31 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
main.asm                                                             PAGE   37

    1977                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1978                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1979                            .dwattr $C$DW$140, DW_AT_decl_line(0x1bf)
    1980                            .dwattr $C$DW$140, DW_AT_decl_column(0x12)
    1981                    
    1982                    $C$DW$141       .dwtag  DW_TAG_member
    1983                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$33)
    1984                            .dwattr $C$DW$141, DW_AT_name("CFSR")
    1985                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("CFSR")
    1986                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1987                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1988                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1989                            .dwattr $C$DW$141, DW_AT_decl_line(0x1c0)
    1990                            .dwattr $C$DW$141, DW_AT_decl_column(0x12)
    1991                    
    1992                    $C$DW$142       .dwtag  DW_TAG_member
    1993                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$33)
    1994                            .dwattr $C$DW$142, DW_AT_name("HFSR")
    1995                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("HFSR")
    1996                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1997                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1998                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1999                            .dwattr $C$DW$142, DW_AT_decl_line(0x1c1)
    2000                            .dwattr $C$DW$142, DW_AT_decl_column(0x12)
    2001                    
    2002                    $C$DW$143       .dwtag  DW_TAG_member
    2003                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$33)
    2004                            .dwattr $C$DW$143, DW_AT_name("DFSR")
    2005                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("DFSR")
    2006                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2007                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2008                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2009                            .dwattr $C$DW$143, DW_AT_decl_line(0x1c2)
    2010                            .dwattr $C$DW$143, DW_AT_decl_column(0x12)
    2011                    
    2012                    $C$DW$144       .dwtag  DW_TAG_member
    2013                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$33)
    2014                            .dwattr $C$DW$144, DW_AT_name("MMFAR")
    2015                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("MMFAR")
    2016                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2017                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2018                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    2019                            .dwattr $C$DW$144, DW_AT_decl_line(0x1c3)
