TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
       3                    ;* Date/Time created: Tue Mar 24 14:16:50 2026                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../InputOutput.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CE2007\Lab1ref_InputOutput\Debug")
      13                    ;       C:\ti\ccsv7\tools\compiler\ti-cgt-arm_16.9.6.LTS\bin\armacpia.exe -@C:\\Users\\KOOMPA~1\\AppDa
      14 00000000                   .sect   ".text"

     523 000000d4 380E              SUBS      A1, A1, #14           ; [DPU_3_PIPE] |115|  ; [ORIG 16-BIT INS]
     524 000000d6 D0DB              BEQ       ||$C$L2||             ; [DPU_3_PIPE] |115|  ; [ORIG 16-BIT INS]
     525                            ; BRANCHCC OCCURS {||$C$L2||}    ; [] |115| 
     526                    ;* --------------------------------------------------------------------------*
     527 000000d8 1E80              SUBS      A1, A1, #2            ; [DPU_3_PIPE] |115|  ; [ORIG 16-BIT INS]
     528 000000da D0EE              BEQ       ||$C$L5||             ; [DPU_3_PIPE] |115|  ; [ORIG 16-BIT INS]
     529                            ; BRANCHCC OCCURS {||$C$L5||}    ; [] |115| 
     530                    ;* --------------------------------------------------------------------------*
     531 000000dc E7D3              B         ||$C$L1||             ; [DPU_3_PIPE] |115|  ; [ORIG 16-BIT INS]
     532                            ; BRANCH OCCURS {||$C$L1||}      ; [] |115| 
     533                    ;* --------------------------------------------------------------------------*
     534                            .dwattr $C$DW$15, DW_AT_TI_end_file("../InputOutput.c")
     535                            .dwattr $C$DW$15, DW_AT_TI_end_line(0x86)
     536                            .dwattr $C$DW$15, DW_AT_TI_end_column(0x01)
     537                            .dwendentry
     538                            .dwendtag $C$DW$15
     539                    
     540                    ;******************************************************************************
     541                    ;* CONSTANT TABLE                                                             *
     542                    ;******************************************************************************
     543 000000de                   .sect   ".text"
     544                            .align  4
     545 000000de 4C0A46C0  ||$C$CON1||:    .bits   1073761290,32
         000000e2 00004000 
     546                            .align  4
     547 000000e2 4C0C4000  ||$C$CON2||:    .bits   1073761292,32
         000000e6 00004000 
     548                            .align  4
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   11

     549 000000e6 4C044000  ||$C$CON3||:    .bits   1073761284,32
         000000ea 00004000 
     550                            .align  4
     551 000000ea 4C064000  ||$C$CON4||:    .bits   1073761286,32
         000000ee 00004000 
     552                            .align  4
     553 000000ee 4C024000  ||$C$CON5||:    .bits   1073761282,32
         000000f2 00004000 
     554                            .align  4
     555 000000f2 4C004000  ||$C$CON6||:    .bits   1073761280,32
         000000f6 00004000 
     556                            .align  4
     557 000000f6 4C0B4000  ||$C$CON7||:    .bits   1073761291,32
         000000fa 00004000 
     558                            .align  4
     559 000000fa 4C0D4000  ||$C$CON8||:    .bits   1073761293,32
         000000fe 00004000 
     560                            .align  4
     561 000000fe 4C094000  ||$C$CON9||:    .bits   1073761289,32
         00000102 00004000 
     562                            .align  4
     563 00000102 4C054000  ||$C$CON10||:   .bits   1073761285,32
         00000106 00004000 
     564                            .align  4
     565 00000106 4C034000  ||$C$CON11||:   .bits   1073761283,32
         0000010a 00004000 
     566                    
     567                    ;******************************************************************************
     568                    ;* BUILD ATTRIBUTES                                                           *
     569                    ;******************************************************************************
     570                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     571                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     572                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     573                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     574                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     575                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     576                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     577                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     578                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     579                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     580                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     581                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     582                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     583                    
     584                    ;******************************************************************************
     585                    ;* TYPE INFORMATION                                                           *
     586                    ;******************************************************************************
     587                    
     588                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     589                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e)
     590                    $C$DW$28        .dwtag  DW_TAG_member
     591                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     592                            .dwattr $C$DW$28, DW_AT_name("IN")
     593                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("IN")
     594                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   12

     595                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     596                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     597                            .dwattr $C$DW$28, DW_AT_decl_line(0x288)
     598                            .dwattr $C$DW$28, DW_AT_decl_column(0x0f)
     599                    
     600                    $C$DW$29        .dwtag  DW_TAG_member
     601                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     602                            .dwattr $C$DW$29, DW_AT_name("RESERVED0")
     603                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("RESERVED0")
     604                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     605                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     606                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     607                            .dwattr $C$DW$29, DW_AT_decl_line(0x289)
     608                            .dwattr $C$DW$29, DW_AT_decl_column(0x0b)
     609                    
     610                    $C$DW$30        .dwtag  DW_TAG_member
     611                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$21)
     612                            .dwattr $C$DW$30, DW_AT_name("OUT")
     613                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("OUT")
     614                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     615                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     616                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     617                            .dwattr $C$DW$30, DW_AT_decl_line(0x28a)
     618                            .dwattr $C$DW$30, DW_AT_decl_column(0x10)
     619                    
     620                    $C$DW$31        .dwtag  DW_TAG_member
     621                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     622                            .dwattr $C$DW$31, DW_AT_name("RESERVED1")
     623                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("RESERVED1")
     624                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     625                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     626                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     627                            .dwattr $C$DW$31, DW_AT_decl_line(0x28b)
     628                            .dwattr $C$DW$31, DW_AT_decl_column(0x0b)
     629                    
     630                    $C$DW$32        .dwtag  DW_TAG_member
     631                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$21)
     632                            .dwattr $C$DW$32, DW_AT_name("DIR")
     633                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("DIR")
     634                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     635                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     636                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     637                            .dwattr $C$DW$32, DW_AT_decl_line(0x28c)
     638                            .dwattr $C$DW$32, DW_AT_decl_column(0x10)
     639                    
     640                    $C$DW$33        .dwtag  DW_TAG_member
     641                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     642                            .dwattr $C$DW$33, DW_AT_name("RESERVED2")
     643                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("RESERVED2")
     644                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     645                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     646                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     647                            .dwattr $C$DW$33, DW_AT_decl_line(0x28d)
     648                            .dwattr $C$DW$33, DW_AT_decl_column(0x0b)
     649                    
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   13

     650                    $C$DW$34        .dwtag  DW_TAG_member
     651                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$21)
     652                            .dwattr $C$DW$34, DW_AT_name("REN")
     653                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("REN")
     654                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     655                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     656                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     657                            .dwattr $C$DW$34, DW_AT_decl_line(0x28e)
     658                            .dwattr $C$DW$34, DW_AT_decl_column(0x10)
     659                    
     660                    $C$DW$35        .dwtag  DW_TAG_member
     661                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     662                            .dwattr $C$DW$35, DW_AT_name("RESERVED3")
     663                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("RESERVED3")
     664                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     665                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     666                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     667                            .dwattr $C$DW$35, DW_AT_decl_line(0x28f)
     668                            .dwattr $C$DW$35, DW_AT_decl_column(0x0b)
     669                    
     670                    $C$DW$36        .dwtag  DW_TAG_member
     671                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$21)
     672                            .dwattr $C$DW$36, DW_AT_name("DS")
     673                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("DS")
     674                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     675                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     676                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     677                            .dwattr $C$DW$36, DW_AT_decl_line(0x290)
     678                            .dwattr $C$DW$36, DW_AT_decl_column(0x10)
     679                    
     680                    $C$DW$37        .dwtag  DW_TAG_member
     681                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     682                            .dwattr $C$DW$37, DW_AT_name("RESERVED4")
     683                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("RESERVED4")
     684                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     685                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     686                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     687                            .dwattr $C$DW$37, DW_AT_decl_line(0x291)
     688                            .dwattr $C$DW$37, DW_AT_decl_column(0x0b)
     689                    
     690                    $C$DW$38        .dwtag  DW_TAG_member
     691                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$21)
     692                            .dwattr $C$DW$38, DW_AT_name("SEL0")
     693                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("SEL0")
     694                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     695                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     696                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     697                            .dwattr $C$DW$38, DW_AT_decl_line(0x292)
     698                            .dwattr $C$DW$38, DW_AT_decl_column(0x10)
     699                    
     700                    $C$DW$39        .dwtag  DW_TAG_member
     701                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     702                            .dwattr $C$DW$39, DW_AT_name("RESERVED5")
     703                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("RESERVED5")
     704                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   14

     705                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     706                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     707                            .dwattr $C$DW$39, DW_AT_decl_line(0x293)
     708                            .dwattr $C$DW$39, DW_AT_decl_column(0x0b)
     709                    
     710                    $C$DW$40        .dwtag  DW_TAG_member
     711                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$21)
     712                            .dwattr $C$DW$40, DW_AT_name("SEL1")
     713                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("SEL1")
     714                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     715                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     716                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     717                            .dwattr $C$DW$40, DW_AT_decl_line(0x294)
     718                            .dwattr $C$DW$40, DW_AT_decl_column(0x10)
     719                    
     720                    $C$DW$41        .dwtag  DW_TAG_member
     721                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     722                            .dwattr $C$DW$41, DW_AT_name("RESERVED6")
     723                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("RESERVED6")
     724                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     725                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     726                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     727                            .dwattr $C$DW$41, DW_AT_decl_line(0x295)
     728                            .dwattr $C$DW$41, DW_AT_decl_column(0x0b)
     729                    
     730                    $C$DW$42        .dwtag  DW_TAG_member
     731                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$23)
     732                            .dwattr $C$DW$42, DW_AT_name("IV")
     733                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("IV")
     734                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     735                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     736                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     737                            .dwattr $C$DW$42, DW_AT_decl_line(0x296)
     738                            .dwattr $C$DW$42, DW_AT_decl_column(0x11)
     739                    
     740                    $C$DW$43        .dwtag  DW_TAG_member
     741                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$24)
     742                            .dwattr $C$DW$43, DW_AT_name("RESERVED7")
     743                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("RESERVED7")
     744                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     745                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     746                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     747                            .dwattr $C$DW$43, DW_AT_decl_line(0x297)
     748                            .dwattr $C$DW$43, DW_AT_decl_column(0x0b)
     749                    
     750                    $C$DW$44        .dwtag  DW_TAG_member
     751                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$21)
     752                            .dwattr $C$DW$44, DW_AT_name("SELC")
     753                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("SELC")
     754                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     755                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     756                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     757                            .dwattr $C$DW$44, DW_AT_decl_line(0x298)
     758                            .dwattr $C$DW$44, DW_AT_decl_column(0x10)
     759                    
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   15

     760                    $C$DW$45        .dwtag  DW_TAG_member
     761                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     762                            .dwattr $C$DW$45, DW_AT_name("RESERVED8")
     763                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("RESERVED8")
     764                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     765                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     766                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     767                            .dwattr $C$DW$45, DW_AT_decl_line(0x299)
     768                            .dwattr $C$DW$45, DW_AT_decl_column(0x0b)
     769                    
     770                    $C$DW$46        .dwtag  DW_TAG_member
     771                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$21)
     772                            .dwattr $C$DW$46, DW_AT_name("IES")
     773                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("IES")
     774                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     775                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     776                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     777                            .dwattr $C$DW$46, DW_AT_decl_line(0x29a)
     778                            .dwattr $C$DW$46, DW_AT_decl_column(0x10)
     779                    
     780                    $C$DW$47        .dwtag  DW_TAG_member
     781                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     782                            .dwattr $C$DW$47, DW_AT_name("RESERVED9")
     783                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("RESERVED9")
     784                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     785                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     786                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     787                            .dwattr $C$DW$47, DW_AT_decl_line(0x29b)
     788                            .dwattr $C$DW$47, DW_AT_decl_column(0x0b)
     789                    
     790                    $C$DW$48        .dwtag  DW_TAG_member
     791                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$21)
     792                            .dwattr $C$DW$48, DW_AT_name("IE")
     793                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("IE")
     794                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     795                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     796                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     797                            .dwattr $C$DW$48, DW_AT_decl_line(0x29c)
     798                            .dwattr $C$DW$48, DW_AT_decl_column(0x10)
     799                    
     800                    $C$DW$49        .dwtag  DW_TAG_member
     801                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     802                            .dwattr $C$DW$49, DW_AT_name("RESERVED10")
     803                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("RESERVED10")
     804                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     805                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     806                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     807                            .dwattr $C$DW$49, DW_AT_decl_line(0x29d)
     808                            .dwattr $C$DW$49, DW_AT_decl_column(0x0b)
     809                    
     810                    $C$DW$50        .dwtag  DW_TAG_member
     811                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     812                            .dwattr $C$DW$50, DW_AT_name("IFG")
     813                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("IFG")
     814                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   16

     815                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     816                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     817                            .dwattr $C$DW$50, DW_AT_decl_line(0x29e)
     818                            .dwattr $C$DW$50, DW_AT_decl_column(0x10)
     819                    
     820                    $C$DW$51        .dwtag  DW_TAG_member
     821                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     822                            .dwattr $C$DW$51, DW_AT_name("RESERVED11")
     823                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("RESERVED11")
     824                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
     825                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     826                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     827                            .dwattr $C$DW$51, DW_AT_decl_line(0x29f)
     828                            .dwattr $C$DW$51, DW_AT_decl_column(0x0b)
     829                    
     830                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     831                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x287)
     832                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     833                            .dwendtag $C$DW$T$25
     834                    
     835                    $C$DW$T$172     .dwtag  DW_TAG_typedef
     836                            .dwattr $C$DW$T$172, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
     837                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$25)
     838                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
     839                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     840                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x2a0)
     841                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
     842                    
     843                    
     844                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
     845                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x20)
     846                    $C$DW$52        .dwtag  DW_TAG_member
     847                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     848                            .dwattr $C$DW$52, DW_AT_name("RESERVED0")
     849                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED0")
     850                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     852                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     853                            .dwattr $C$DW$52, DW_AT_decl_line(0x2a3)
     854                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     855                    
     856                    $C$DW$53        .dwtag  DW_TAG_member
     857                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     858                            .dwattr $C$DW$53, DW_AT_name("IN")
     859                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("IN")
     860                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     861                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     862                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     863                            .dwattr $C$DW$53, DW_AT_decl_line(0x2a4)
     864                            .dwattr $C$DW$53, DW_AT_decl_column(0x0f)
     865                    
     866                    $C$DW$54        .dwtag  DW_TAG_member
     867                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     868                            .dwattr $C$DW$54, DW_AT_name("RESERVED1")
     869                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED1")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   17

     870                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     871                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     872                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     873                            .dwattr $C$DW$54, DW_AT_decl_line(0x2a5)
     874                            .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
     875                    
     876                    $C$DW$55        .dwtag  DW_TAG_member
     877                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     878                            .dwattr $C$DW$55, DW_AT_name("OUT")
     879                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("OUT")
     880                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     881                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     882                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     883                            .dwattr $C$DW$55, DW_AT_decl_line(0x2a6)
     884                            .dwattr $C$DW$55, DW_AT_decl_column(0x10)
     885                    
     886                    $C$DW$56        .dwtag  DW_TAG_member
     887                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     888                            .dwattr $C$DW$56, DW_AT_name("RESERVED2")
     889                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED2")
     890                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     891                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     892                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     893                            .dwattr $C$DW$56, DW_AT_decl_line(0x2a7)
     894                            .dwattr $C$DW$56, DW_AT_decl_column(0x0b)
     895                    
     896                    $C$DW$57        .dwtag  DW_TAG_member
     897                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     898                            .dwattr $C$DW$57, DW_AT_name("DIR")
     899                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("DIR")
     900                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     901                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     902                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     903                            .dwattr $C$DW$57, DW_AT_decl_line(0x2a8)
     904                            .dwattr $C$DW$57, DW_AT_decl_column(0x10)
     905                    
     906                    $C$DW$58        .dwtag  DW_TAG_member
     907                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     908                            .dwattr $C$DW$58, DW_AT_name("RESERVED3")
     909                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("RESERVED3")
     910                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     911                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     912                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     913                            .dwattr $C$DW$58, DW_AT_decl_line(0x2a9)
     914                            .dwattr $C$DW$58, DW_AT_decl_column(0x0b)
     915                    
     916                    $C$DW$59        .dwtag  DW_TAG_member
     917                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     918                            .dwattr $C$DW$59, DW_AT_name("REN")
     919                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("REN")
     920                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     921                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     922                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     923                            .dwattr $C$DW$59, DW_AT_decl_line(0x2aa)
     924                            .dwattr $C$DW$59, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   18

     925                    
     926                    $C$DW$60        .dwtag  DW_TAG_member
     927                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     928                            .dwattr $C$DW$60, DW_AT_name("RESERVED4")
     929                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("RESERVED4")
     930                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     931                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     932                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     933                            .dwattr $C$DW$60, DW_AT_decl_line(0x2ab)
     934                            .dwattr $C$DW$60, DW_AT_decl_column(0x0b)
     935                    
     936                    $C$DW$61        .dwtag  DW_TAG_member
     937                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     938                            .dwattr $C$DW$61, DW_AT_name("DS")
     939                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("DS")
     940                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     941                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     942                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     943                            .dwattr $C$DW$61, DW_AT_decl_line(0x2ac)
     944                            .dwattr $C$DW$61, DW_AT_decl_column(0x10)
     945                    
     946                    $C$DW$62        .dwtag  DW_TAG_member
     947                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     948                            .dwattr $C$DW$62, DW_AT_name("RESERVED5")
     949                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED5")
     950                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     951                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     952                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     953                            .dwattr $C$DW$62, DW_AT_decl_line(0x2ad)
     954                            .dwattr $C$DW$62, DW_AT_decl_column(0x0b)
     955                    
     956                    $C$DW$63        .dwtag  DW_TAG_member
     957                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
     958                            .dwattr $C$DW$63, DW_AT_name("SEL0")
     959                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SEL0")
     960                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     961                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     962                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     963                            .dwattr $C$DW$63, DW_AT_decl_line(0x2ae)
     964                            .dwattr $C$DW$63, DW_AT_decl_column(0x10)
     965                    
     966                    $C$DW$64        .dwtag  DW_TAG_member
     967                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     968                            .dwattr $C$DW$64, DW_AT_name("RESERVED6")
     969                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED6")
     970                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     971                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     972                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     973                            .dwattr $C$DW$64, DW_AT_decl_line(0x2af)
     974                            .dwattr $C$DW$64, DW_AT_decl_column(0x0b)
     975                    
     976                    $C$DW$65        .dwtag  DW_TAG_member
     977                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     978                            .dwattr $C$DW$65, DW_AT_name("SEL1")
     979                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("SEL1")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   19

     980                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     981                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     982                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     983                            .dwattr $C$DW$65, DW_AT_decl_line(0x2b0)
     984                            .dwattr $C$DW$65, DW_AT_decl_column(0x10)
     985                    
     986                    $C$DW$66        .dwtag  DW_TAG_member
     987                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$26)
     988                            .dwattr $C$DW$66, DW_AT_name("RESERVED7")
     989                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("RESERVED7")
     990                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     991                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     992                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     993                            .dwattr $C$DW$66, DW_AT_decl_line(0x2b1)
     994                            .dwattr $C$DW$66, DW_AT_decl_column(0x0b)
     995                    
     996                    $C$DW$67        .dwtag  DW_TAG_member
     997                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
     998                            .dwattr $C$DW$67, DW_AT_name("SELC")
     999                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("SELC")
    1000                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1001                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1002                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1003                            .dwattr $C$DW$67, DW_AT_decl_line(0x2b2)
    1004                            .dwattr $C$DW$67, DW_AT_decl_column(0x10)
    1005                    
    1006                    $C$DW$68        .dwtag  DW_TAG_member
    1007                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1008                            .dwattr $C$DW$68, DW_AT_name("RESERVED8")
    1009                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("RESERVED8")
    1010                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1011                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1012                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1013                            .dwattr $C$DW$68, DW_AT_decl_line(0x2b3)
    1014                            .dwattr $C$DW$68, DW_AT_decl_column(0x0b)
    1015                    
    1016                    $C$DW$69        .dwtag  DW_TAG_member
    1017                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
    1018                            .dwattr $C$DW$69, DW_AT_name("IES")
    1019                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("IES")
    1020                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1021                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1022                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1023                            .dwattr $C$DW$69, DW_AT_decl_line(0x2b4)
    1024                            .dwattr $C$DW$69, DW_AT_decl_column(0x10)
    1025                    
    1026                    $C$DW$70        .dwtag  DW_TAG_member
    1027                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1028                            .dwattr $C$DW$70, DW_AT_name("RESERVED9")
    1029                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("RESERVED9")
    1030                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1031                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1032                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1033                            .dwattr $C$DW$70, DW_AT_decl_line(0x2b5)
    1034                            .dwattr $C$DW$70, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   20

    1035                    
    1036                    $C$DW$71        .dwtag  DW_TAG_member
    1037                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
    1038                            .dwattr $C$DW$71, DW_AT_name("IE")
    1039                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("IE")
    1040                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1041                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1042                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1043                            .dwattr $C$DW$71, DW_AT_decl_line(0x2b6)
    1044                            .dwattr $C$DW$71, DW_AT_decl_column(0x10)
    1045                    
    1046                    $C$DW$72        .dwtag  DW_TAG_member
    1047                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1048                            .dwattr $C$DW$72, DW_AT_name("RESERVED10")
    1049                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED10")
    1050                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1051                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1052                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1053                            .dwattr $C$DW$72, DW_AT_decl_line(0x2b7)
    1054                            .dwattr $C$DW$72, DW_AT_decl_column(0x0b)
    1055                    
    1056                    $C$DW$73        .dwtag  DW_TAG_member
    1057                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1058                            .dwattr $C$DW$73, DW_AT_name("IFG")
    1059                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("IFG")
    1060                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1061                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1062                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1063                            .dwattr $C$DW$73, DW_AT_decl_line(0x2b8)
    1064                            .dwattr $C$DW$73, DW_AT_decl_column(0x10)
    1065                    
    1066                    $C$DW$74        .dwtag  DW_TAG_member
    1067                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$23)
    1068                            .dwattr $C$DW$74, DW_AT_name("IV")
    1069                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("IV")
    1070                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1071                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1072                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1073                            .dwattr $C$DW$74, DW_AT_decl_line(0x2b9)
    1074                            .dwattr $C$DW$74, DW_AT_decl_column(0x10)
    1075                    
    1076                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1077                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2a2)
    1078                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1079                            .dwendtag $C$DW$T$27
    1080                    
    1081                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1082                            .dwattr $C$DW$T$174, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    1083                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$27)
    1084                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1085                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1086                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x2ba)
    1087                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x03)
    1088                    
    1089                    
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   21

    1090                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1091                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1092                    $C$DW$75        .dwtag  DW_TAG_member
    1093                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$28)
    1094                            .dwattr $C$DW$75, DW_AT_name("_reserved0")
    1095                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("_reserved0")
    1096                            .dwattr $C$DW$75, DW_AT_bit_offset(0x10)
    1097                            .dwattr $C$DW$75, DW_AT_bit_size(0x10)
    1098                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1100                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1101                            .dwattr $C$DW$75, DW_AT_decl_line(0x105)
    1102                            .dwattr $C$DW$75, DW_AT_decl_column(0x0e)
    1103                    
    1104                    $C$DW$76        .dwtag  DW_TAG_member
    1105                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$28)
    1106                            .dwattr $C$DW$76, DW_AT_name("GE")
    1107                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("GE")
    1108                            .dwattr $C$DW$76, DW_AT_bit_offset(0x0c)
    1109                            .dwattr $C$DW$76, DW_AT_bit_size(0x04)
    1110                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1112                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1113                            .dwattr $C$DW$76, DW_AT_decl_line(0x106)
    1114                            .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
    1115                    
    1116                    $C$DW$77        .dwtag  DW_TAG_member
    1117                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$28)
    1118                            .dwattr $C$DW$77, DW_AT_name("_reserved1")
    1119                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("_reserved1")
    1120                            .dwattr $C$DW$77, DW_AT_bit_offset(0x05)
    1121                            .dwattr $C$DW$77, DW_AT_bit_size(0x07)
    1122                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1124                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1125                            .dwattr $C$DW$77, DW_AT_decl_line(0x107)
    1126                            .dwattr $C$DW$77, DW_AT_decl_column(0x0e)
    1127                    
    1128                    $C$DW$78        .dwtag  DW_TAG_member
    1129                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$28)
    1130                            .dwattr $C$DW$78, DW_AT_name("Q")
    1131                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("Q")
    1132                            .dwattr $C$DW$78, DW_AT_bit_offset(0x04)
    1133                            .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1134                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1136                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1137                            .dwattr $C$DW$78, DW_AT_decl_line(0x108)
    1138                            .dwattr $C$DW$78, DW_AT_decl_column(0x0e)
    1139                    
    1140                    $C$DW$79        .dwtag  DW_TAG_member
    1141                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$28)
    1142                            .dwattr $C$DW$79, DW_AT_name("V")
    1143                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("V")
    1144                            .dwattr $C$DW$79, DW_AT_bit_offset(0x03)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   22

    1145                            .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1146                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1148                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1149                            .dwattr $C$DW$79, DW_AT_decl_line(0x109)
    1150                            .dwattr $C$DW$79, DW_AT_decl_column(0x0e)
    1151                    
    1152                    $C$DW$80        .dwtag  DW_TAG_member
    1153                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$28)
    1154                            .dwattr $C$DW$80, DW_AT_name("C")
    1155                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("C")
    1156                            .dwattr $C$DW$80, DW_AT_bit_offset(0x02)
    1157                            .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1158                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1160                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1161                            .dwattr $C$DW$80, DW_AT_decl_line(0x10a)
    1162                            .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
    1163                    
    1164                    $C$DW$81        .dwtag  DW_TAG_member
    1165                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$28)
    1166                            .dwattr $C$DW$81, DW_AT_name("Z")
    1167                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("Z")
    1168                            .dwattr $C$DW$81, DW_AT_bit_offset(0x01)
    1169                            .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1170                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1172                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1173                            .dwattr $C$DW$81, DW_AT_decl_line(0x10b)
    1174                            .dwattr $C$DW$81, DW_AT_decl_column(0x0e)
    1175                    
    1176                    $C$DW$82        .dwtag  DW_TAG_member
    1177                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$28)
    1178                            .dwattr $C$DW$82, DW_AT_name("N")
    1179                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("N")
    1180                            .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1181                            .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1182                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1184                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1185                            .dwattr $C$DW$82, DW_AT_decl_line(0x10c)
    1186                            .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1187                    
    1188                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1189                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x104)
    1190                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    1191                            .dwendtag $C$DW$T$29
    1192                    
    1193                    
    1194                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1195                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1196                    $C$DW$83        .dwtag  DW_TAG_member
    1197                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$28)
    1198                            .dwattr $C$DW$83, DW_AT_name("ISR")
    1199                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("ISR")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   23

    1200                            .dwattr $C$DW$83, DW_AT_bit_offset(0x17)
    1201                            .dwattr $C$DW$83, DW_AT_bit_size(0x09)
    1202                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1204                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1205                            .dwattr $C$DW$83, DW_AT_decl_line(0x12c)
    1206                            .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
    1207                    
    1208                    $C$DW$84        .dwtag  DW_TAG_member
    1209                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$28)
    1210                            .dwattr $C$DW$84, DW_AT_name("_reserved0")
    1211                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("_reserved0")
    1212                            .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
    1213                            .dwattr $C$DW$84, DW_AT_bit_size(0x17)
    1214                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1216                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1217                            .dwattr $C$DW$84, DW_AT_decl_line(0x12d)
    1218                            .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    1219                    
    1220                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1221                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x12b)
    1222                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    1223                            .dwendtag $C$DW$T$30
    1224                    
    1225                    
    1226                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1227                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1228                    $C$DW$85        .dwtag  DW_TAG_member
    1229                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$28)
    1230                            .dwattr $C$DW$85, DW_AT_name("ISR")
    1231                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("ISR")
    1232                            .dwattr $C$DW$85, DW_AT_bit_offset(0x17)
    1233                            .dwattr $C$DW$85, DW_AT_bit_size(0x09)
    1234                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1236                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1237                            .dwattr $C$DW$85, DW_AT_decl_line(0x13e)
    1238                            .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1239                    
    1240                    $C$DW$86        .dwtag  DW_TAG_member
    1241                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$28)
    1242                            .dwattr $C$DW$86, DW_AT_name("_reserved0")
    1243                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("_reserved0")
    1244                            .dwattr $C$DW$86, DW_AT_bit_offset(0x16)
    1245                            .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1246                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1248                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1249                            .dwattr $C$DW$86, DW_AT_decl_line(0x13f)
    1250                            .dwattr $C$DW$86, DW_AT_decl_column(0x0e)
    1251                    
    1252                    $C$DW$87        .dwtag  DW_TAG_member
    1253                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$28)
    1254                            .dwattr $C$DW$87, DW_AT_name("ICI_IT_1")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   24

    1255                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("ICI_IT_1")
    1256                            .dwattr $C$DW$87, DW_AT_bit_offset(0x10)
    1257                            .dwattr $C$DW$87, DW_AT_bit_size(0x06)
    1258                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1260                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1261                            .dwattr $C$DW$87, DW_AT_decl_line(0x140)
    1262                            .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1263                    
    1264                    $C$DW$88        .dwtag  DW_TAG_member
    1265                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$28)
    1266                            .dwattr $C$DW$88, DW_AT_name("GE")
    1267                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("GE")
    1268                            .dwattr $C$DW$88, DW_AT_bit_offset(0x0c)
    1269                            .dwattr $C$DW$88, DW_AT_bit_size(0x04)
    1270                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1272                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1273                            .dwattr $C$DW$88, DW_AT_decl_line(0x141)
    1274                            .dwattr $C$DW$88, DW_AT_decl_column(0x0e)
    1275                    
    1276                    $C$DW$89        .dwtag  DW_TAG_member
    1277                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$28)
    1278                            .dwattr $C$DW$89, DW_AT_name("_reserved1")
    1279                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("_reserved1")
    1280                            .dwattr $C$DW$89, DW_AT_bit_offset(0x08)
    1281                            .dwattr $C$DW$89, DW_AT_bit_size(0x04)
    1282                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1284                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1285                            .dwattr $C$DW$89, DW_AT_decl_line(0x142)
    1286                            .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
    1287                    
    1288                    $C$DW$90        .dwtag  DW_TAG_member
    1289                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$28)
    1290                            .dwattr $C$DW$90, DW_AT_name("T")
    1291                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("T")
    1292                            .dwattr $C$DW$90, DW_AT_bit_offset(0x07)
    1293                            .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1294                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1296                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1297                            .dwattr $C$DW$90, DW_AT_decl_line(0x143)
    1298                            .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1299                    
    1300                    $C$DW$91        .dwtag  DW_TAG_member
    1301                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$28)
    1302                            .dwattr $C$DW$91, DW_AT_name("ICI_IT_2")
    1303                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ICI_IT_2")
    1304                            .dwattr $C$DW$91, DW_AT_bit_offset(0x05)
    1305                            .dwattr $C$DW$91, DW_AT_bit_size(0x02)
    1306                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1308                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1309                            .dwattr $C$DW$91, DW_AT_decl_line(0x144)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   25

    1310                            .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1311                    
    1312                    $C$DW$92        .dwtag  DW_TAG_member
    1313                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$28)
    1314                            .dwattr $C$DW$92, DW_AT_name("Q")
    1315                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("Q")
    1316                            .dwattr $C$DW$92, DW_AT_bit_offset(0x04)
    1317                            .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1318                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1320                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1321                            .dwattr $C$DW$92, DW_AT_decl_line(0x145)
    1322                            .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1323                    
    1324                    $C$DW$93        .dwtag  DW_TAG_member
    1325                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$28)
    1326                            .dwattr $C$DW$93, DW_AT_name("V")
    1327                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("V")
    1328                            .dwattr $C$DW$93, DW_AT_bit_offset(0x03)
    1329                            .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1330                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1332                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1333                            .dwattr $C$DW$93, DW_AT_decl_line(0x146)
    1334                            .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
    1335                    
    1336                    $C$DW$94        .dwtag  DW_TAG_member
    1337                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$28)
    1338                            .dwattr $C$DW$94, DW_AT_name("C")
    1339                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("C")
    1340                            .dwattr $C$DW$94, DW_AT_bit_offset(0x02)
    1341                            .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1342                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1344                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1345                            .dwattr $C$DW$94, DW_AT_decl_line(0x147)
    1346                            .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1347                    
    1348                    $C$DW$95        .dwtag  DW_TAG_member
    1349                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$28)
    1350                            .dwattr $C$DW$95, DW_AT_name("Z")
    1351                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("Z")
    1352                            .dwattr $C$DW$95, DW_AT_bit_offset(0x01)
    1353                            .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1354                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1356                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1357                            .dwattr $C$DW$95, DW_AT_decl_line(0x148)
    1358                            .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1359                    
    1360                    $C$DW$96        .dwtag  DW_TAG_member
    1361                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    1362                            .dwattr $C$DW$96, DW_AT_name("N")
    1363                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("N")
    1364                            .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   26

    1365                            .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1366                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1368                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1369                            .dwattr $C$DW$96, DW_AT_decl_line(0x149)
    1370                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1371                    
    1372                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1373                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x13d)
    1374                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    1375                            .dwendtag $C$DW$T$31
    1376                    
    1377                    
    1378                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1379                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    1380                    $C$DW$97        .dwtag  DW_TAG_member
    1381                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
    1382                            .dwattr $C$DW$97, DW_AT_name("nPRIV")
    1383                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("nPRIV")
    1384                            .dwattr $C$DW$97, DW_AT_bit_offset(0x1f)
    1385                            .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1386                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1388                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1389                            .dwattr $C$DW$97, DW_AT_decl_line(0x175)
    1390                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1391                    
    1392                    $C$DW$98        .dwtag  DW_TAG_member
    1393                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$28)
    1394                            .dwattr $C$DW$98, DW_AT_name("SPSEL")
    1395                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("SPSEL")
    1396                            .dwattr $C$DW$98, DW_AT_bit_offset(0x1e)
    1397                            .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1398                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1400                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1401                            .dwattr $C$DW$98, DW_AT_decl_line(0x176)
    1402                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1403                    
    1404                    $C$DW$99        .dwtag  DW_TAG_member
    1405                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    1406                            .dwattr $C$DW$99, DW_AT_name("FPCA")
    1407                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("FPCA")
    1408                            .dwattr $C$DW$99, DW_AT_bit_offset(0x1d)
    1409                            .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1410                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1412                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1413                            .dwattr $C$DW$99, DW_AT_decl_line(0x177)
    1414                            .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1415                    
    1416                    $C$DW$100       .dwtag  DW_TAG_member
    1417                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
    1418                            .dwattr $C$DW$100, DW_AT_name("_reserved0")
    1419                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("_reserved0")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   27

    1420                            .dwattr $C$DW$100, DW_AT_bit_offset(0x00)
    1421                            .dwattr $C$DW$100, DW_AT_bit_size(0x1d)
    1422                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1424                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1425                            .dwattr $C$DW$100, DW_AT_decl_line(0x178)
    1426                            .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1427                    
    1428                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1429                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x174)
    1430                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1431                            .dwendtag $C$DW$T$32
    1432                    
    1433                    
    1434                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1435                            .dwattr $C$DW$T$39, DW_AT_byte_size(0xe04)
    1436                    $C$DW$101       .dwtag  DW_TAG_member
    1437                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$34)
    1438                            .dwattr $C$DW$101, DW_AT_name("ISER")
    1439                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("ISER")
    1440                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1442                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1443                            .dwattr $C$DW$101, DW_AT_decl_line(0x196)
    1444                            .dwattr $C$DW$101, DW_AT_decl_column(0x12)
    1445                    
    1446                    $C$DW$102       .dwtag  DW_TAG_member
    1447                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$35)
    1448                            .dwattr $C$DW$102, DW_AT_name("RESERVED0")
    1449                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("RESERVED0")
    1450                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1451                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1452                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1453                            .dwattr $C$DW$102, DW_AT_decl_line(0x197)
    1454                            .dwattr $C$DW$102, DW_AT_decl_column(0x12)
    1455                    
    1456                    $C$DW$103       .dwtag  DW_TAG_member
    1457                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$34)
    1458                            .dwattr $C$DW$103, DW_AT_name("ICER")
    1459                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("ICER")
    1460                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1461                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1462                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1463                            .dwattr $C$DW$103, DW_AT_decl_line(0x198)
    1464                            .dwattr $C$DW$103, DW_AT_decl_column(0x12)
    1465                    
    1466                    $C$DW$104       .dwtag  DW_TAG_member
    1467                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$35)
    1468                            .dwattr $C$DW$104, DW_AT_name("RSERVED1")
    1469                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("RSERVED1")
    1470                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1471                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1472                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1473                            .dwattr $C$DW$104, DW_AT_decl_line(0x199)
    1474                            .dwattr $C$DW$104, DW_AT_decl_column(0x12)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   28

    1475                    
    1476                    $C$DW$105       .dwtag  DW_TAG_member
    1477                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$34)
    1478                            .dwattr $C$DW$105, DW_AT_name("ISPR")
    1479                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("ISPR")
    1480                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1481                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1482                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1483                            .dwattr $C$DW$105, DW_AT_decl_line(0x19a)
    1484                            .dwattr $C$DW$105, DW_AT_decl_column(0x12)
    1485                    
    1486                    $C$DW$106       .dwtag  DW_TAG_member
    1487                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$35)
    1488                            .dwattr $C$DW$106, DW_AT_name("RESERVED2")
    1489                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("RESERVED2")
    1490                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1491                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1492                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1493                            .dwattr $C$DW$106, DW_AT_decl_line(0x19b)
    1494                            .dwattr $C$DW$106, DW_AT_decl_column(0x12)
    1495                    
    1496                    $C$DW$107       .dwtag  DW_TAG_member
    1497                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$34)
    1498                            .dwattr $C$DW$107, DW_AT_name("ICPR")
    1499                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("ICPR")
    1500                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1501                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1502                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1503                            .dwattr $C$DW$107, DW_AT_decl_line(0x19c)
    1504                            .dwattr $C$DW$107, DW_AT_decl_column(0x12)
    1505                    
    1506                    $C$DW$108       .dwtag  DW_TAG_member
    1507                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$35)
    1508                            .dwattr $C$DW$108, DW_AT_name("RESERVED3")
    1509                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("RESERVED3")
    1510                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1511                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1512                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1513                            .dwattr $C$DW$108, DW_AT_decl_line(0x19d)
    1514                            .dwattr $C$DW$108, DW_AT_decl_column(0x12)
    1515                    
    1516                    $C$DW$109       .dwtag  DW_TAG_member
    1517                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$34)
    1518                            .dwattr $C$DW$109, DW_AT_name("IABR")
    1519                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("IABR")
    1520                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1521                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1522                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1523                            .dwattr $C$DW$109, DW_AT_decl_line(0x19e)
    1524                            .dwattr $C$DW$109, DW_AT_decl_column(0x12)
    1525                    
    1526                    $C$DW$110       .dwtag  DW_TAG_member
    1527                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$36)
    1528                            .dwattr $C$DW$110, DW_AT_name("RESERVED4")
    1529                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("RESERVED4")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   29

    1530                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1531                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1532                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1533                            .dwattr $C$DW$110, DW_AT_decl_line(0x19f)
    1534                            .dwattr $C$DW$110, DW_AT_decl_column(0x12)
    1535                    
    1536                    $C$DW$111       .dwtag  DW_TAG_member
    1537                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$37)
    1538                            .dwattr $C$DW$111, DW_AT_name("IP")
    1539                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("IP")
    1540                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1541                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1542                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1543                            .dwattr $C$DW$111, DW_AT_decl_line(0x1a0)
    1544                            .dwattr $C$DW$111, DW_AT_decl_column(0x12)
    1545                    
    1546                    $C$DW$112       .dwtag  DW_TAG_member
    1547                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$38)
    1548                            .dwattr $C$DW$112, DW_AT_name("RESERVED5")
    1549                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("RESERVED5")
    1550                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1551                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1552                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1553                            .dwattr $C$DW$112, DW_AT_decl_line(0x1a1)
    1554                            .dwattr $C$DW$112, DW_AT_decl_column(0x12)
    1555                    
    1556                    $C$DW$113       .dwtag  DW_TAG_member
    1557                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$33)
    1558                            .dwattr $C$DW$113, DW_AT_name("STIR")
    1559                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("STIR")
    1560                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1561                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1562                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1563                            .dwattr $C$DW$113, DW_AT_decl_line(0x1a2)
    1564                            .dwattr $C$DW$113, DW_AT_decl_column(0x12)
    1565                    
    1566                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1567                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x195)
    1568                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    1569                            .dwendtag $C$DW$T$39
    1570                    
    1571                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    1572                            .dwattr $C$DW$T$176, DW_AT_name("NVIC_Type")
    1573                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$39)
    1574                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    1575                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1576                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x1a3)
    1577                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x04)
    1578                    
    1579                    
    1580                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1581                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x8c)
    1582                    $C$DW$114       .dwtag  DW_TAG_member
    1583                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$40)
    1584                            .dwattr $C$DW$114, DW_AT_name("CPUID")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   30

    1585                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("CPUID")
    1586                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1588                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1589                            .dwattr $C$DW$114, DW_AT_decl_line(0x1b8)
    1590                            .dwattr $C$DW$114, DW_AT_decl_column(0x12)
    1591                    
    1592                    $C$DW$115       .dwtag  DW_TAG_member
    1593                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$33)
    1594                            .dwattr $C$DW$115, DW_AT_name("ICSR")
    1595                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("ICSR")
    1596                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1597                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1598                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1599                            .dwattr $C$DW$115, DW_AT_decl_line(0x1b9)
    1600                            .dwattr $C$DW$115, DW_AT_decl_column(0x12)
    1601                    
    1602                    $C$DW$116       .dwtag  DW_TAG_member
    1603                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$33)
    1604                            .dwattr $C$DW$116, DW_AT_name("VTOR")
    1605                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("VTOR")
    1606                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1607                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1608                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1609                            .dwattr $C$DW$116, DW_AT_decl_line(0x1ba)
    1610                            .dwattr $C$DW$116, DW_AT_decl_column(0x12)
    1611                    
    1612                    $C$DW$117       .dwtag  DW_TAG_member
    1613                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$33)
    1614                            .dwattr $C$DW$117, DW_AT_name("AIRCR")
    1615                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("AIRCR")
    1616                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1617                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1618                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1619                            .dwattr $C$DW$117, DW_AT_decl_line(0x1bb)
    1620                            .dwattr $C$DW$117, DW_AT_decl_column(0x12)
    1621                    
    1622                    $C$DW$118       .dwtag  DW_TAG_member
    1623                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$33)
    1624                            .dwattr $C$DW$118, DW_AT_name("SCR")
    1625                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("SCR")
    1626                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1627                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1628                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1629                            .dwattr $C$DW$118, DW_AT_decl_line(0x1bc)
    1630                            .dwattr $C$DW$118, DW_AT_decl_column(0x12)
    1631                    
    1632                    $C$DW$119       .dwtag  DW_TAG_member
    1633                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$33)
    1634                            .dwattr $C$DW$119, DW_AT_name("CCR")
    1635                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("CCR")
    1636                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1637                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1638                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1639                            .dwattr $C$DW$119, DW_AT_decl_line(0x1bd)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   31

    1640                            .dwattr $C$DW$119, DW_AT_decl_column(0x12)
    1641                    
    1642                    $C$DW$120       .dwtag  DW_TAG_member
    1643                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$41)
    1644                            .dwattr $C$DW$120, DW_AT_name("SHP")
    1645                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("SHP")
    1646                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1647                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1648                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1649                            .dwattr $C$DW$120, DW_AT_decl_line(0x1be)
    1650                            .dwattr $C$DW$120, DW_AT_decl_column(0x12)
    1651                    
    1652                    $C$DW$121       .dwtag  DW_TAG_member
    1653                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    1654                            .dwattr $C$DW$121, DW_AT_name("SHCSR")
    1655                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("SHCSR")
    1656                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1657                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1658                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1659                            .dwattr $C$DW$121, DW_AT_decl_line(0x1bf)
    1660                            .dwattr $C$DW$121, DW_AT_decl_column(0x12)
    1661                    
    1662                    $C$DW$122       .dwtag  DW_TAG_member
    1663                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$33)
    1664                            .dwattr $C$DW$122, DW_AT_name("CFSR")
    1665                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("CFSR")
    1666                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1667                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1668                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1669                            .dwattr $C$DW$122, DW_AT_decl_line(0x1c0)
    1670                            .dwattr $C$DW$122, DW_AT_decl_column(0x12)
    1671                    
    1672                    $C$DW$123       .dwtag  DW_TAG_member
    1673                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$33)
    1674                            .dwattr $C$DW$123, DW_AT_name("HFSR")
    1675                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("HFSR")
    1676                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1677                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1678                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1679                            .dwattr $C$DW$123, DW_AT_decl_line(0x1c1)
    1680                            .dwattr $C$DW$123, DW_AT_decl_column(0x12)
    1681                    
    1682                    $C$DW$124       .dwtag  DW_TAG_member
    1683                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$33)
    1684                            .dwattr $C$DW$124, DW_AT_name("DFSR")
    1685                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("DFSR")
    1686                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1687                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1688                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1689                            .dwattr $C$DW$124, DW_AT_decl_line(0x1c2)
    1690                            .dwattr $C$DW$124, DW_AT_decl_column(0x12)
    1691                    
    1692                    $C$DW$125       .dwtag  DW_TAG_member
    1693                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$33)
    1694                            .dwattr $C$DW$125, DW_AT_name("MMFAR")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
InputOutput.asm                                                      PAGE   32

    1695                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("MMFAR")
    1696                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1697                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1698                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1699                            .dwattr $C$DW$125, DW_AT_decl_line(0x1c3)
