TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.6.LTS *
       3                    ;* Date/Time created: Tue Mar 24 14:16:50 2026                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../system_msp432p401r.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.6.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\CE2007\Lab1ref_InputOutput\Debug")
      13                            .global SystemCoreClock
      14 00000000                   .data
      15                            .align  4

     636                            .dwattr $C$DW$11, DW_AT_TI_end_column(0x01)
     637                            .dwendentry
     638                            .dwendtag $C$DW$11
     639                    
     640                    ;******************************************************************************
     641                    ;* CONSTANT TABLE                                                             *
     642                    ;******************************************************************************
     643 000002cc                   .sect   ".text"
     644                            .align  4
     645 000002cc 40010408  ||$C$CON1||:    .bits   1073808392,32
     646                            .align  4
     647 000002d0 42208900  ||$C$CON2||:    .bits   1109428480,32
     648                            .align  4
     649 000002d4 40010400  ||$C$CON3||:    .bits   1073808384,32
     650                            .align  4
     651 000002d8 40010450  ||$C$CON4||:    .bits   1073808464,32
     652                            .align  4
     653 000002dc 4220863C  ||$C$CON5||:    .bits   1109427772,32
     654                            .align  4
     655 000002e0 00000000! ||$C$CON6||:    .bits   SystemCoreClock,32
     656                            .align  4
     657 000002e4 40010404  ||$C$CON7||:    .bits   1073808388,32
     658                            .align  4
     659 000002e8 0016E360  ||$C$CON8||:    .bits   1500000,32
     660                            .align  4
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   13

     661 000002ec 002DC6C0  ||$C$CON9||:    .bits   3000000,32
     662                            .align  4
     663 000002f0 005B8D80  ||$C$CON10||:   .bits   6000000,32
     664                            .align  4
     665 000002f4 00B71B00  ||$C$CON11||:   .bits   12000000,32
     666                            .align  4
     667 000002f8 016E3600  ||$C$CON12||:   .bits   24000000,32
     668                            .align  4
     669 000002fc 02DC6C00  ||$C$CON13||:   .bits   48000000,32
     670                            .align  4
     671 00000300 422080D8  ||$C$CON14||:   .bits   1109426392,32
     672                            .align  4
     673 00000304 00201084  ||$C$CON15||:   .bits   2101380,32
     674                            .align  4
     675 00000308 0020106C  ||$C$CON16||:   .bits   2101356,32
     676                            .align  4
     677 0000030c 00201064  ||$C$CON17||:   .bits   2101348,32
     678                            .align  4
     679 00000310 0020104C  ||$C$CON18||:   .bits   2101324,32
     680                            .align  4
     681 00000314 42208904  ||$C$CON19||:   .bits   1109428484,32
     682                            .align  4
     683 00000318 E000ED88  ||$C$CON20||:   .bits   -536810104,32
     684                            .align  4
     685 0000031c 4000480C  ||$C$CON21||:   .bits   1073760268,32
     686                            .align  4
     687 00000320 E0043014  ||$C$CON22||:   .bits   -536596460,32
     688                            .align  4
     689 00000324 40011010  ||$C$CON23||:   .bits   1073811472,32
     690                            .align  4
     691 00000328 40011014  ||$C$CON24||:   .bits   1073811476,32
     692                    
     693                    ;******************************************************************************
     694                    ;* BUILD ATTRIBUTES                                                           *
     695                    ;******************************************************************************
     696                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     697                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     698                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     699                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     700                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     701                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     702                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     703                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     704                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     705                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     706                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     707                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     708                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     709                    
     710                    ;******************************************************************************
     711                    ;* TYPE INFORMATION                                                           *
     712                    ;******************************************************************************
     713                    
     714                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
     715                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x68)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   14

     716                    $C$DW$13        .dwtag  DW_TAG_member
     717                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     718                            .dwattr $C$DW$13, DW_AT_name("KEY")
     719                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("KEY")
     720                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     722                            .dwattr $C$DW$13, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     723                            .dwattr $C$DW$13, DW_AT_decl_line(0x1d9)
     724                            .dwattr $C$DW$13, DW_AT_decl_column(0x11)
     725                    
     726                    $C$DW$14        .dwtag  DW_TAG_member
     727                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     728                            .dwattr $C$DW$14, DW_AT_name("CTL0")
     729                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("CTL0")
     730                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     731                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     732                            .dwattr $C$DW$14, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     733                            .dwattr $C$DW$14, DW_AT_decl_line(0x1da)
     734                            .dwattr $C$DW$14, DW_AT_decl_column(0x11)
     735                    
     736                    $C$DW$15        .dwtag  DW_TAG_member
     737                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     738                            .dwattr $C$DW$15, DW_AT_name("CTL1")
     739                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("CTL1")
     740                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     741                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     742                            .dwattr $C$DW$15, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     743                            .dwattr $C$DW$15, DW_AT_decl_line(0x1db)
     744                            .dwattr $C$DW$15, DW_AT_decl_column(0x11)
     745                    
     746                    $C$DW$16        .dwtag  DW_TAG_member
     747                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     748                            .dwattr $C$DW$16, DW_AT_name("CTL2")
     749                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("CTL2")
     750                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     751                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     752                            .dwattr $C$DW$16, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     753                            .dwattr $C$DW$16, DW_AT_decl_line(0x1dc)
     754                            .dwattr $C$DW$16, DW_AT_decl_column(0x11)
     755                    
     756                    $C$DW$17        .dwtag  DW_TAG_member
     757                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
     758                            .dwattr $C$DW$17, DW_AT_name("CTL3")
     759                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("CTL3")
     760                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     761                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     762                            .dwattr $C$DW$17, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     763                            .dwattr $C$DW$17, DW_AT_decl_line(0x1dd)
     764                            .dwattr $C$DW$17, DW_AT_decl_column(0x11)
     765                    
     766                    $C$DW$18        .dwtag  DW_TAG_member
     767                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$21)
     768                            .dwattr $C$DW$18, DW_AT_name("RESERVED0")
     769                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("RESERVED0")
     770                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   15

     771                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     772                            .dwattr $C$DW$18, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     773                            .dwattr $C$DW$18, DW_AT_decl_line(0x1de)
     774                            .dwattr $C$DW$18, DW_AT_decl_column(0x11)
     775                    
     776                    $C$DW$19        .dwtag  DW_TAG_member
     777                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
     778                            .dwattr $C$DW$19, DW_AT_name("CLKEN")
     779                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("CLKEN")
     780                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     781                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     782                            .dwattr $C$DW$19, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     783                            .dwattr $C$DW$19, DW_AT_decl_line(0x1df)
     784                            .dwattr $C$DW$19, DW_AT_decl_column(0x11)
     785                    
     786                    $C$DW$20        .dwtag  DW_TAG_member
     787                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$22)
     788                            .dwattr $C$DW$20, DW_AT_name("STAT")
     789                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("STAT")
     790                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     791                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     792                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     793                            .dwattr $C$DW$20, DW_AT_decl_line(0x1e0)
     794                            .dwattr $C$DW$20, DW_AT_decl_column(0x11)
     795                    
     796                    $C$DW$21        .dwtag  DW_TAG_member
     797                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$23)
     798                            .dwattr $C$DW$21, DW_AT_name("RESERVED1")
     799                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("RESERVED1")
     800                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     801                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     802                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     803                            .dwattr $C$DW$21, DW_AT_decl_line(0x1e1)
     804                            .dwattr $C$DW$21, DW_AT_decl_column(0x11)
     805                    
     806                    $C$DW$22        .dwtag  DW_TAG_member
     807                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     808                            .dwattr $C$DW$22, DW_AT_name("IE")
     809                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("IE")
     810                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     811                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     812                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     813                            .dwattr $C$DW$22, DW_AT_decl_line(0x1e2)
     814                            .dwattr $C$DW$22, DW_AT_decl_column(0x11)
     815                    
     816                    $C$DW$23        .dwtag  DW_TAG_member
     817                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     818                            .dwattr $C$DW$23, DW_AT_name("RESERVED2")
     819                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("RESERVED2")
     820                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     821                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     822                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     823                            .dwattr $C$DW$23, DW_AT_decl_line(0x1e3)
     824                            .dwattr $C$DW$23, DW_AT_decl_column(0x11)
     825                    
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   16

     826                    $C$DW$24        .dwtag  DW_TAG_member
     827                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     828                            .dwattr $C$DW$24, DW_AT_name("IFG")
     829                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("IFG")
     830                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     831                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     832                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     833                            .dwattr $C$DW$24, DW_AT_decl_line(0x1e4)
     834                            .dwattr $C$DW$24, DW_AT_decl_column(0x11)
     835                    
     836                    $C$DW$25        .dwtag  DW_TAG_member
     837                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     838                            .dwattr $C$DW$25, DW_AT_name("RESERVED3")
     839                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("RESERVED3")
     840                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     841                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     842                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     843                            .dwattr $C$DW$25, DW_AT_decl_line(0x1e5)
     844                            .dwattr $C$DW$25, DW_AT_decl_column(0x11)
     845                    
     846                    $C$DW$26        .dwtag  DW_TAG_member
     847                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     848                            .dwattr $C$DW$26, DW_AT_name("CLRIFG")
     849                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("CLRIFG")
     850                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     851                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     852                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     853                            .dwattr $C$DW$26, DW_AT_decl_line(0x1e6)
     854                            .dwattr $C$DW$26, DW_AT_decl_column(0x11)
     855                    
     856                    $C$DW$27        .dwtag  DW_TAG_member
     857                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     858                            .dwattr $C$DW$27, DW_AT_name("RESERVED4")
     859                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("RESERVED4")
     860                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     861                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     862                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     863                            .dwattr $C$DW$27, DW_AT_decl_line(0x1e7)
     864                            .dwattr $C$DW$27, DW_AT_decl_column(0x11)
     865                    
     866                    $C$DW$28        .dwtag  DW_TAG_member
     867                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
     868                            .dwattr $C$DW$28, DW_AT_name("SETIFG")
     869                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("SETIFG")
     870                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     871                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     872                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     873                            .dwattr $C$DW$28, DW_AT_decl_line(0x1e8)
     874                            .dwattr $C$DW$28, DW_AT_decl_column(0x11)
     875                    
     876                    $C$DW$29        .dwtag  DW_TAG_member
     877                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     878                            .dwattr $C$DW$29, DW_AT_name("RESERVED5")
     879                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("RESERVED5")
     880                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   17

     881                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     882                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     883                            .dwattr $C$DW$29, DW_AT_decl_line(0x1e9)
     884                            .dwattr $C$DW$29, DW_AT_decl_column(0x11)
     885                    
     886                    $C$DW$30        .dwtag  DW_TAG_member
     887                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
     888                            .dwattr $C$DW$30, DW_AT_name("DCOERCAL0")
     889                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("DCOERCAL0")
     890                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     891                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     892                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     893                            .dwattr $C$DW$30, DW_AT_decl_line(0x1ea)
     894                            .dwattr $C$DW$30, DW_AT_decl_column(0x11)
     895                    
     896                    $C$DW$31        .dwtag  DW_TAG_member
     897                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     898                            .dwattr $C$DW$31, DW_AT_name("DCOERCAL1")
     899                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("DCOERCAL1")
     900                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     901                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     902                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     903                            .dwattr $C$DW$31, DW_AT_decl_line(0x1eb)
     904                            .dwattr $C$DW$31, DW_AT_decl_column(0x11)
     905                    
     906                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     907                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x1d8)
     908                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     909                            .dwendtag $C$DW$T$24
     910                    
     911                    $C$DW$T$172     .dwtag  DW_TAG_typedef
     912                            .dwattr $C$DW$T$172, DW_AT_name("CS_Type")
     913                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$24)
     914                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
     915                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     916                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x1ec)
     917                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
     918                    
     919                    
     920                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     921                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x14c)
     922                    $C$DW$32        .dwtag  DW_TAG_member
     923                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
     924                            .dwattr $C$DW$32, DW_AT_name("TLV_CHECKSUM")
     925                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("TLV_CHECKSUM")
     926                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     928                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     929                            .dwattr $C$DW$32, DW_AT_decl_line(0x4c4)
     930                            .dwattr $C$DW$32, DW_AT_decl_column(0x11)
     931                    
     932                    $C$DW$33        .dwtag  DW_TAG_member
     933                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     934                            .dwattr $C$DW$33, DW_AT_name("DEVICE_INFO_TAG")
     935                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("DEVICE_INFO_TAG")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   18

     936                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     937                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     938                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     939                            .dwattr $C$DW$33, DW_AT_decl_line(0x4c5)
     940                            .dwattr $C$DW$33, DW_AT_decl_column(0x11)
     941                    
     942                    $C$DW$34        .dwtag  DW_TAG_member
     943                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
     944                            .dwattr $C$DW$34, DW_AT_name("DEVICE_INFO_LEN")
     945                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("DEVICE_INFO_LEN")
     946                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     947                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     948                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     949                            .dwattr $C$DW$34, DW_AT_decl_line(0x4c6)
     950                            .dwattr $C$DW$34, DW_AT_decl_column(0x11)
     951                    
     952                    $C$DW$35        .dwtag  DW_TAG_member
     953                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
     954                            .dwattr $C$DW$35, DW_AT_name("DEVICE_ID")
     955                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("DEVICE_ID")
     956                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     957                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     958                            .dwattr $C$DW$35, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     959                            .dwattr $C$DW$35, DW_AT_decl_line(0x4c7)
     960                            .dwattr $C$DW$35, DW_AT_decl_column(0x11)
     961                    
     962                    $C$DW$36        .dwtag  DW_TAG_member
     963                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
     964                            .dwattr $C$DW$36, DW_AT_name("HWREV")
     965                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("HWREV")
     966                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     967                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     968                            .dwattr $C$DW$36, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     969                            .dwattr $C$DW$36, DW_AT_decl_line(0x4c8)
     970                            .dwattr $C$DW$36, DW_AT_decl_column(0x11)
     971                    
     972                    $C$DW$37        .dwtag  DW_TAG_member
     973                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$22)
     974                            .dwattr $C$DW$37, DW_AT_name("BCREV")
     975                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("BCREV")
     976                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     977                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     978                            .dwattr $C$DW$37, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     979                            .dwattr $C$DW$37, DW_AT_decl_line(0x4c9)
     980                            .dwattr $C$DW$37, DW_AT_decl_column(0x11)
     981                    
     982                    $C$DW$38        .dwtag  DW_TAG_member
     983                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$22)
     984                            .dwattr $C$DW$38, DW_AT_name("ROM_DRVLIB_REV")
     985                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("ROM_DRVLIB_REV")
     986                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     987                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     988                            .dwattr $C$DW$38, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     989                            .dwattr $C$DW$38, DW_AT_decl_line(0x4ca)
     990                            .dwattr $C$DW$38, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   19

     991                    
     992                    $C$DW$39        .dwtag  DW_TAG_member
     993                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
     994                            .dwattr $C$DW$39, DW_AT_name("DIE_REC_TAG")
     995                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("DIE_REC_TAG")
     996                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     997                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     998                            .dwattr $C$DW$39, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
     999                            .dwattr $C$DW$39, DW_AT_decl_line(0x4cb)
    1000                            .dwattr $C$DW$39, DW_AT_decl_column(0x11)
    1001                    
    1002                    $C$DW$40        .dwtag  DW_TAG_member
    1003                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$22)
    1004                            .dwattr $C$DW$40, DW_AT_name("DIE_REC_LEN")
    1005                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("DIE_REC_LEN")
    1006                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1007                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1008                            .dwattr $C$DW$40, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1009                            .dwattr $C$DW$40, DW_AT_decl_line(0x4cc)
    1010                            .dwattr $C$DW$40, DW_AT_decl_column(0x11)
    1011                    
    1012                    $C$DW$41        .dwtag  DW_TAG_member
    1013                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
    1014                            .dwattr $C$DW$41, DW_AT_name("DIE_XPOS")
    1015                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("DIE_XPOS")
    1016                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1017                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1018                            .dwattr $C$DW$41, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1019                            .dwattr $C$DW$41, DW_AT_decl_line(0x4cd)
    1020                            .dwattr $C$DW$41, DW_AT_decl_column(0x11)
    1021                    
    1022                    $C$DW$42        .dwtag  DW_TAG_member
    1023                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
    1024                            .dwattr $C$DW$42, DW_AT_name("DIE_YPOS")
    1025                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("DIE_YPOS")
    1026                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1027                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1028                            .dwattr $C$DW$42, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1029                            .dwattr $C$DW$42, DW_AT_decl_line(0x4ce)
    1030                            .dwattr $C$DW$42, DW_AT_decl_column(0x11)
    1031                    
    1032                    $C$DW$43        .dwtag  DW_TAG_member
    1033                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$22)
    1034                            .dwattr $C$DW$43, DW_AT_name("WAFER_ID")
    1035                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("WAFER_ID")
    1036                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1037                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1038                            .dwattr $C$DW$43, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1039                            .dwattr $C$DW$43, DW_AT_decl_line(0x4cf)
    1040                            .dwattr $C$DW$43, DW_AT_decl_column(0x11)
    1041                    
    1042                    $C$DW$44        .dwtag  DW_TAG_member
    1043                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
    1044                            .dwattr $C$DW$44, DW_AT_name("LOT_ID")
    1045                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("LOT_ID")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   20

    1046                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1047                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1048                            .dwattr $C$DW$44, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1049                            .dwattr $C$DW$44, DW_AT_decl_line(0x4d0)
    1050                            .dwattr $C$DW$44, DW_AT_decl_column(0x11)
    1051                    
    1052                    $C$DW$45        .dwtag  DW_TAG_member
    1053                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$22)
    1054                            .dwattr $C$DW$45, DW_AT_name("RESERVED0")
    1055                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("RESERVED0")
    1056                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1057                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1058                            .dwattr $C$DW$45, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1059                            .dwattr $C$DW$45, DW_AT_decl_line(0x4d1)
    1060                            .dwattr $C$DW$45, DW_AT_decl_column(0x11)
    1061                    
    1062                    $C$DW$46        .dwtag  DW_TAG_member
    1063                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$22)
    1064                            .dwattr $C$DW$46, DW_AT_name("RESERVED1")
    1065                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("RESERVED1")
    1066                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1067                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1068                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1069                            .dwattr $C$DW$46, DW_AT_decl_line(0x4d2)
    1070                            .dwattr $C$DW$46, DW_AT_decl_column(0x11)
    1071                    
    1072                    $C$DW$47        .dwtag  DW_TAG_member
    1073                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
    1074                            .dwattr $C$DW$47, DW_AT_name("RESERVED2")
    1075                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("RESERVED2")
    1076                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1077                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1078                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1079                            .dwattr $C$DW$47, DW_AT_decl_line(0x4d3)
    1080                            .dwattr $C$DW$47, DW_AT_decl_column(0x11)
    1081                    
    1082                    $C$DW$48        .dwtag  DW_TAG_member
    1083                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
    1084                            .dwattr $C$DW$48, DW_AT_name("TEST_RESULTS")
    1085                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("TEST_RESULTS")
    1086                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1087                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1088                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1089                            .dwattr $C$DW$48, DW_AT_decl_line(0x4d4)
    1090                            .dwattr $C$DW$48, DW_AT_decl_column(0x11)
    1091                    
    1092                    $C$DW$49        .dwtag  DW_TAG_member
    1093                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$22)
    1094                            .dwattr $C$DW$49, DW_AT_name("CS_CAL_TAG")
    1095                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("CS_CAL_TAG")
    1096                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1097                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1098                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1099                            .dwattr $C$DW$49, DW_AT_decl_line(0x4d5)
    1100                            .dwattr $C$DW$49, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   21

    1101                    
    1102                    $C$DW$50        .dwtag  DW_TAG_member
    1103                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$22)
    1104                            .dwattr $C$DW$50, DW_AT_name("CS_CAL_LEN")
    1105                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("CS_CAL_LEN")
    1106                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1107                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1108                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1109                            .dwattr $C$DW$50, DW_AT_decl_line(0x4d6)
    1110                            .dwattr $C$DW$50, DW_AT_decl_column(0x11)
    1111                    
    1112                    $C$DW$51        .dwtag  DW_TAG_member
    1113                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$22)
    1114                            .dwattr $C$DW$51, DW_AT_name("DCOIR_FCAL_RSEL04")
    1115                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL04")
    1116                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1117                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1118                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1119                            .dwattr $C$DW$51, DW_AT_decl_line(0x4d7)
    1120                            .dwattr $C$DW$51, DW_AT_decl_column(0x11)
    1121                    
    1122                    $C$DW$52        .dwtag  DW_TAG_member
    1123                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
    1124                            .dwattr $C$DW$52, DW_AT_name("DCOIR_FCAL_RSEL5")
    1125                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("DCOIR_FCAL_RSEL5")
    1126                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1127                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1128                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1129                            .dwattr $C$DW$52, DW_AT_decl_line(0x4d8)
    1130                            .dwattr $C$DW$52, DW_AT_decl_column(0x11)
    1131                    
    1132                    $C$DW$53        .dwtag  DW_TAG_member
    1133                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$22)
    1134                            .dwattr $C$DW$53, DW_AT_name("RESERVED3")
    1135                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("RESERVED3")
    1136                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1137                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1138                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1139                            .dwattr $C$DW$53, DW_AT_decl_line(0x4d9)
    1140                            .dwattr $C$DW$53, DW_AT_decl_column(0x11)
    1141                    
    1142                    $C$DW$54        .dwtag  DW_TAG_member
    1143                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
    1144                            .dwattr $C$DW$54, DW_AT_name("RESERVED4")
    1145                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED4")
    1146                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1147                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1148                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1149                            .dwattr $C$DW$54, DW_AT_decl_line(0x4da)
    1150                            .dwattr $C$DW$54, DW_AT_decl_column(0x11)
    1151                    
    1152                    $C$DW$55        .dwtag  DW_TAG_member
    1153                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
    1154                            .dwattr $C$DW$55, DW_AT_name("RESERVED5")
    1155                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("RESERVED5")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   22

    1156                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1157                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1158                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1159                            .dwattr $C$DW$55, DW_AT_decl_line(0x4db)
    1160                            .dwattr $C$DW$55, DW_AT_decl_column(0x11)
    1161                    
    1162                    $C$DW$56        .dwtag  DW_TAG_member
    1163                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
    1164                            .dwattr $C$DW$56, DW_AT_name("RESERVED6")
    1165                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED6")
    1166                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1167                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1168                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1169                            .dwattr $C$DW$56, DW_AT_decl_line(0x4dc)
    1170                            .dwattr $C$DW$56, DW_AT_decl_column(0x11)
    1171                    
    1172                    $C$DW$57        .dwtag  DW_TAG_member
    1173                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$22)
    1174                            .dwattr $C$DW$57, DW_AT_name("DCOIR_CONSTK_RSEL04")
    1175                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL04")
    1176                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1177                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1178                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1179                            .dwattr $C$DW$57, DW_AT_decl_line(0x4dd)
    1180                            .dwattr $C$DW$57, DW_AT_decl_column(0x11)
    1181                    
    1182                    $C$DW$58        .dwtag  DW_TAG_member
    1183                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
    1184                            .dwattr $C$DW$58, DW_AT_name("DCOIR_CONSTK_RSEL5")
    1185                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("DCOIR_CONSTK_RSEL5")
    1186                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1187                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1188                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1189                            .dwattr $C$DW$58, DW_AT_decl_line(0x4de)
    1190                            .dwattr $C$DW$58, DW_AT_decl_column(0x11)
    1191                    
    1192                    $C$DW$59        .dwtag  DW_TAG_member
    1193                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$22)
    1194                            .dwattr $C$DW$59, DW_AT_name("DCOER_FCAL_RSEL04")
    1195                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL04")
    1196                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1197                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1198                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1199                            .dwattr $C$DW$59, DW_AT_decl_line(0x4df)
    1200                            .dwattr $C$DW$59, DW_AT_decl_column(0x11)
    1201                    
    1202                    $C$DW$60        .dwtag  DW_TAG_member
    1203                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
    1204                            .dwattr $C$DW$60, DW_AT_name("DCOER_FCAL_RSEL5")
    1205                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("DCOER_FCAL_RSEL5")
    1206                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1207                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1208                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1209                            .dwattr $C$DW$60, DW_AT_decl_line(0x4e0)
    1210                            .dwattr $C$DW$60, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   23

    1211                    
    1212                    $C$DW$61        .dwtag  DW_TAG_member
    1213                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
    1214                            .dwattr $C$DW$61, DW_AT_name("RESERVED7")
    1215                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("RESERVED7")
    1216                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1217                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1218                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1219                            .dwattr $C$DW$61, DW_AT_decl_line(0x4e1)
    1220                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1221                    
    1222                    $C$DW$62        .dwtag  DW_TAG_member
    1223                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$22)
    1224                            .dwattr $C$DW$62, DW_AT_name("RESERVED8")
    1225                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED8")
    1226                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1227                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1228                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1229                            .dwattr $C$DW$62, DW_AT_decl_line(0x4e2)
    1230                            .dwattr $C$DW$62, DW_AT_decl_column(0x11)
    1231                    
    1232                    $C$DW$63        .dwtag  DW_TAG_member
    1233                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
    1234                            .dwattr $C$DW$63, DW_AT_name("RESERVED9")
    1235                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("RESERVED9")
    1236                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1237                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1238                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1239                            .dwattr $C$DW$63, DW_AT_decl_line(0x4e3)
    1240                            .dwattr $C$DW$63, DW_AT_decl_column(0x11)
    1241                    
    1242                    $C$DW$64        .dwtag  DW_TAG_member
    1243                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
    1244                            .dwattr $C$DW$64, DW_AT_name("RESERVED10")
    1245                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED10")
    1246                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1247                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1248                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1249                            .dwattr $C$DW$64, DW_AT_decl_line(0x4e4)
    1250                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
    1251                    
    1252                    $C$DW$65        .dwtag  DW_TAG_member
    1253                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
    1254                            .dwattr $C$DW$65, DW_AT_name("DCOER_CONSTK_RSEL04")
    1255                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL04")
    1256                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1257                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1258                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1259                            .dwattr $C$DW$65, DW_AT_decl_line(0x4e5)
    1260                            .dwattr $C$DW$65, DW_AT_decl_column(0x11)
    1261                    
    1262                    $C$DW$66        .dwtag  DW_TAG_member
    1263                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1264                            .dwattr $C$DW$66, DW_AT_name("DCOER_CONSTK_RSEL5")
    1265                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("DCOER_CONSTK_RSEL5")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   24

    1266                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1267                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1268                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1269                            .dwattr $C$DW$66, DW_AT_decl_line(0x4e6)
    1270                            .dwattr $C$DW$66, DW_AT_decl_column(0x11)
    1271                    
    1272                    $C$DW$67        .dwtag  DW_TAG_member
    1273                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$22)
    1274                            .dwattr $C$DW$67, DW_AT_name("ADC14_CAL_TAG")
    1275                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("ADC14_CAL_TAG")
    1276                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1277                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1278                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1279                            .dwattr $C$DW$67, DW_AT_decl_line(0x4e7)
    1280                            .dwattr $C$DW$67, DW_AT_decl_column(0x11)
    1281                    
    1282                    $C$DW$68        .dwtag  DW_TAG_member
    1283                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
    1284                            .dwattr $C$DW$68, DW_AT_name("ADC14_CAL_LEN")
    1285                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("ADC14_CAL_LEN")
    1286                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1287                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1288                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1289                            .dwattr $C$DW$68, DW_AT_decl_line(0x4e8)
    1290                            .dwattr $C$DW$68, DW_AT_decl_column(0x11)
    1291                    
    1292                    $C$DW$69        .dwtag  DW_TAG_member
    1293                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$22)
    1294                            .dwattr $C$DW$69, DW_AT_name("ADC_GAIN_FACTOR")
    1295                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("ADC_GAIN_FACTOR")
    1296                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1297                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1298                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1299                            .dwattr $C$DW$69, DW_AT_decl_line(0x4e9)
    1300                            .dwattr $C$DW$69, DW_AT_decl_column(0x11)
    1301                    
    1302                    $C$DW$70        .dwtag  DW_TAG_member
    1303                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
    1304                            .dwattr $C$DW$70, DW_AT_name("ADC_OFFSET")
    1305                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("ADC_OFFSET")
    1306                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1307                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1308                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1309                            .dwattr $C$DW$70, DW_AT_decl_line(0x4ea)
    1310                            .dwattr $C$DW$70, DW_AT_decl_column(0x11)
    1311                    
    1312                    $C$DW$71        .dwtag  DW_TAG_member
    1313                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
    1314                            .dwattr $C$DW$71, DW_AT_name("RESERVED11")
    1315                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED11")
    1316                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1317                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1318                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1319                            .dwattr $C$DW$71, DW_AT_decl_line(0x4eb)
    1320                            .dwattr $C$DW$71, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   25

    1321                    
    1322                    $C$DW$72        .dwtag  DW_TAG_member
    1323                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
    1324                            .dwattr $C$DW$72, DW_AT_name("RESERVED12")
    1325                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("RESERVED12")
    1326                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1327                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1328                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1329                            .dwattr $C$DW$72, DW_AT_decl_line(0x4ec)
    1330                            .dwattr $C$DW$72, DW_AT_decl_column(0x11)
    1331                    
    1332                    $C$DW$73        .dwtag  DW_TAG_member
    1333                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$22)
    1334                            .dwattr $C$DW$73, DW_AT_name("RESERVED13")
    1335                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED13")
    1336                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1337                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1338                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1339                            .dwattr $C$DW$73, DW_AT_decl_line(0x4ed)
    1340                            .dwattr $C$DW$73, DW_AT_decl_column(0x11)
    1341                    
    1342                    $C$DW$74        .dwtag  DW_TAG_member
    1343                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$22)
    1344                            .dwattr $C$DW$74, DW_AT_name("RESERVED14")
    1345                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED14")
    1346                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1347                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1348                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1349                            .dwattr $C$DW$74, DW_AT_decl_line(0x4ee)
    1350                            .dwattr $C$DW$74, DW_AT_decl_column(0x11)
    1351                    
    1352                    $C$DW$75        .dwtag  DW_TAG_member
    1353                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
    1354                            .dwattr $C$DW$75, DW_AT_name("RESERVED15")
    1355                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED15")
    1356                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1357                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1358                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1359                            .dwattr $C$DW$75, DW_AT_decl_line(0x4ef)
    1360                            .dwattr $C$DW$75, DW_AT_decl_column(0x11)
    1361                    
    1362                    $C$DW$76        .dwtag  DW_TAG_member
    1363                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$22)
    1364                            .dwattr $C$DW$76, DW_AT_name("RESERVED16")
    1365                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("RESERVED16")
    1366                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1367                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1368                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1369                            .dwattr $C$DW$76, DW_AT_decl_line(0x4f0)
    1370                            .dwattr $C$DW$76, DW_AT_decl_column(0x11)
    1371                    
    1372                    $C$DW$77        .dwtag  DW_TAG_member
    1373                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
    1374                            .dwattr $C$DW$77, DW_AT_name("RESERVED17")
    1375                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED17")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   26

    1376                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1377                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1378                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1379                            .dwattr $C$DW$77, DW_AT_decl_line(0x4f1)
    1380                            .dwattr $C$DW$77, DW_AT_decl_column(0x11)
    1381                    
    1382                    $C$DW$78        .dwtag  DW_TAG_member
    1383                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$22)
    1384                            .dwattr $C$DW$78, DW_AT_name("RESERVED18")
    1385                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("RESERVED18")
    1386                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1387                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1388                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1389                            .dwattr $C$DW$78, DW_AT_decl_line(0x4f2)
    1390                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1391                    
    1392                    $C$DW$79        .dwtag  DW_TAG_member
    1393                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
    1394                            .dwattr $C$DW$79, DW_AT_name("RESERVED19")
    1395                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED19")
    1396                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1397                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1398                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1399                            .dwattr $C$DW$79, DW_AT_decl_line(0x4f3)
    1400                            .dwattr $C$DW$79, DW_AT_decl_column(0x11)
    1401                    
    1402                    $C$DW$80        .dwtag  DW_TAG_member
    1403                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$22)
    1404                            .dwattr $C$DW$80, DW_AT_name("RESERVED20")
    1405                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("RESERVED20")
    1406                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1407                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1408                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1409                            .dwattr $C$DW$80, DW_AT_decl_line(0x4f4)
    1410                            .dwattr $C$DW$80, DW_AT_decl_column(0x11)
    1411                    
    1412                    $C$DW$81        .dwtag  DW_TAG_member
    1413                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
    1414                            .dwattr $C$DW$81, DW_AT_name("RESERVED21")
    1415                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED21")
    1416                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1417                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1418                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1419                            .dwattr $C$DW$81, DW_AT_decl_line(0x4f5)
    1420                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    1421                    
    1422                    $C$DW$82        .dwtag  DW_TAG_member
    1423                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$22)
    1424                            .dwattr $C$DW$82, DW_AT_name("RESERVED22")
    1425                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED22")
    1426                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1427                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1428                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1429                            .dwattr $C$DW$82, DW_AT_decl_line(0x4f6)
    1430                            .dwattr $C$DW$82, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   27

    1431                    
    1432                    $C$DW$83        .dwtag  DW_TAG_member
    1433                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
    1434                            .dwattr $C$DW$83, DW_AT_name("RESERVED23")
    1435                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED23")
    1436                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    1437                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1438                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1439                            .dwattr $C$DW$83, DW_AT_decl_line(0x4f7)
    1440                            .dwattr $C$DW$83, DW_AT_decl_column(0x11)
    1441                    
    1442                    $C$DW$84        .dwtag  DW_TAG_member
    1443                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$22)
    1444                            .dwattr $C$DW$84, DW_AT_name("RESERVED24")
    1445                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("RESERVED24")
    1446                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1447                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1448                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1449                            .dwattr $C$DW$84, DW_AT_decl_line(0x4f8)
    1450                            .dwattr $C$DW$84, DW_AT_decl_column(0x11)
    1451                    
    1452                    $C$DW$85        .dwtag  DW_TAG_member
    1453                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    1454                            .dwattr $C$DW$85, DW_AT_name("RESERVED25")
    1455                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED25")
    1456                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1457                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1458                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1459                            .dwattr $C$DW$85, DW_AT_decl_line(0x4f9)
    1460                            .dwattr $C$DW$85, DW_AT_decl_column(0x11)
    1461                    
    1462                    $C$DW$86        .dwtag  DW_TAG_member
    1463                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
    1464                            .dwattr $C$DW$86, DW_AT_name("RESERVED26")
    1465                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("RESERVED26")
    1466                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1467                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1468                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1469                            .dwattr $C$DW$86, DW_AT_decl_line(0x4fa)
    1470                            .dwattr $C$DW$86, DW_AT_decl_column(0x11)
    1471                    
    1472                    $C$DW$87        .dwtag  DW_TAG_member
    1473                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
    1474                            .dwattr $C$DW$87, DW_AT_name("ADC14_REF1P2V_TS30C")
    1475                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS30C")
    1476                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1477                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1478                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1479                            .dwattr $C$DW$87, DW_AT_decl_line(0x4fb)
    1480                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1481                    
    1482                    $C$DW$88        .dwtag  DW_TAG_member
    1483                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
    1484                            .dwattr $C$DW$88, DW_AT_name("ADC14_REF1P2V_TS85C")
    1485                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("ADC14_REF1P2V_TS85C")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   28

    1486                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1487                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1488                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1489                            .dwattr $C$DW$88, DW_AT_decl_line(0x4fc)
    1490                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1491                    
    1492                    $C$DW$89        .dwtag  DW_TAG_member
    1493                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
    1494                            .dwattr $C$DW$89, DW_AT_name("ADC14_REF1P45V_TS30C")
    1495                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS30C")
    1496                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1497                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1498                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1499                            .dwattr $C$DW$89, DW_AT_decl_line(0x4fd)
    1500                            .dwattr $C$DW$89, DW_AT_decl_column(0x11)
    1501                    
    1502                    $C$DW$90        .dwtag  DW_TAG_member
    1503                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$22)
    1504                            .dwattr $C$DW$90, DW_AT_name("ADC14_REF1P45V_TS85C")
    1505                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("ADC14_REF1P45V_TS85C")
    1506                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1507                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1508                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1509                            .dwattr $C$DW$90, DW_AT_decl_line(0x4fe)
    1510                            .dwattr $C$DW$90, DW_AT_decl_column(0x11)
    1511                    
    1512                    $C$DW$91        .dwtag  DW_TAG_member
    1513                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
    1514                            .dwattr $C$DW$91, DW_AT_name("ADC14_REF2P5V_TS30C")
    1515                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS30C")
    1516                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1517                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1518                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1519                            .dwattr $C$DW$91, DW_AT_decl_line(0x4ff)
    1520                            .dwattr $C$DW$91, DW_AT_decl_column(0x11)
    1521                    
    1522                    $C$DW$92        .dwtag  DW_TAG_member
    1523                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
    1524                            .dwattr $C$DW$92, DW_AT_name("ADC14_REF2P5V_TS85C")
    1525                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("ADC14_REF2P5V_TS85C")
    1526                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1527                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1528                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1529                            .dwattr $C$DW$92, DW_AT_decl_line(0x500)
    1530                            .dwattr $C$DW$92, DW_AT_decl_column(0x11)
    1531                    
    1532                    $C$DW$93        .dwtag  DW_TAG_member
    1533                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
    1534                            .dwattr $C$DW$93, DW_AT_name("REF_CAL_TAG")
    1535                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("REF_CAL_TAG")
    1536                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1537                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1538                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1539                            .dwattr $C$DW$93, DW_AT_decl_line(0x501)
    1540                            .dwattr $C$DW$93, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   29

    1541                    
    1542                    $C$DW$94        .dwtag  DW_TAG_member
    1543                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
    1544                            .dwattr $C$DW$94, DW_AT_name("REF_CAL_LEN")
    1545                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("REF_CAL_LEN")
    1546                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1547                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1548                            .dwattr $C$DW$94, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1549                            .dwattr $C$DW$94, DW_AT_decl_line(0x502)
    1550                            .dwattr $C$DW$94, DW_AT_decl_column(0x11)
    1551                    
    1552                    $C$DW$95        .dwtag  DW_TAG_member
    1553                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$22)
    1554                            .dwattr $C$DW$95, DW_AT_name("REF_1P2V")
    1555                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("REF_1P2V")
    1556                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1557                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1558                            .dwattr $C$DW$95, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1559                            .dwattr $C$DW$95, DW_AT_decl_line(0x503)
    1560                            .dwattr $C$DW$95, DW_AT_decl_column(0x11)
    1561                    
    1562                    $C$DW$96        .dwtag  DW_TAG_member
    1563                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$22)
    1564                            .dwattr $C$DW$96, DW_AT_name("REF_1P45V")
    1565                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("REF_1P45V")
    1566                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1567                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1568                            .dwattr $C$DW$96, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1569                            .dwattr $C$DW$96, DW_AT_decl_line(0x504)
    1570                            .dwattr $C$DW$96, DW_AT_decl_column(0x11)
    1571                    
    1572                    $C$DW$97        .dwtag  DW_TAG_member
    1573                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
    1574                            .dwattr $C$DW$97, DW_AT_name("REF_2P5V")
    1575                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("REF_2P5V")
    1576                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    1577                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1578                            .dwattr $C$DW$97, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1579                            .dwattr $C$DW$97, DW_AT_decl_line(0x505)
    1580                            .dwattr $C$DW$97, DW_AT_decl_column(0x11)
    1581                    
    1582                    $C$DW$98        .dwtag  DW_TAG_member
    1583                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$22)
    1584                            .dwattr $C$DW$98, DW_AT_name("FLASH_INFO_TAG")
    1585                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("FLASH_INFO_TAG")
    1586                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    1587                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1588                            .dwattr $C$DW$98, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1589                            .dwattr $C$DW$98, DW_AT_decl_line(0x506)
    1590                            .dwattr $C$DW$98, DW_AT_decl_column(0x11)
    1591                    
    1592                    $C$DW$99        .dwtag  DW_TAG_member
    1593                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$22)
    1594                            .dwattr $C$DW$99, DW_AT_name("FLASH_INFO_LEN")
    1595                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("FLASH_INFO_LEN")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   30

    1596                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    1597                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1598                            .dwattr $C$DW$99, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1599                            .dwattr $C$DW$99, DW_AT_decl_line(0x507)
    1600                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    1601                    
    1602                    $C$DW$100       .dwtag  DW_TAG_member
    1603                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$22)
    1604                            .dwattr $C$DW$100, DW_AT_name("FLASH_MAX_PROG_PULSES")
    1605                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("FLASH_MAX_PROG_PULSES")
    1606                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    1607                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1608                            .dwattr $C$DW$100, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1609                            .dwattr $C$DW$100, DW_AT_decl_line(0x508)
    1610                            .dwattr $C$DW$100, DW_AT_decl_column(0x11)
    1611                    
    1612                    $C$DW$101       .dwtag  DW_TAG_member
    1613                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
    1614                            .dwattr $C$DW$101, DW_AT_name("FLASH_MAX_ERASE_PULSES")
    1615                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("FLASH_MAX_ERASE_PULSES")
    1616                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1617                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1618                            .dwattr $C$DW$101, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1619                            .dwattr $C$DW$101, DW_AT_decl_line(0x509)
    1620                            .dwattr $C$DW$101, DW_AT_decl_column(0x11)
    1621                    
    1622                    $C$DW$102       .dwtag  DW_TAG_member
    1623                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
    1624                            .dwattr $C$DW$102, DW_AT_name("RANDOM_NUM_TAG")
    1625                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("RANDOM_NUM_TAG")
    1626                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    1627                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1628                            .dwattr $C$DW$102, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1629                            .dwattr $C$DW$102, DW_AT_decl_line(0x50a)
    1630                            .dwattr $C$DW$102, DW_AT_decl_column(0x11)
    1631                    
    1632                    $C$DW$103       .dwtag  DW_TAG_member
    1633                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$22)
    1634                            .dwattr $C$DW$103, DW_AT_name("RANDOM_NUM_LEN")
    1635                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("RANDOM_NUM_LEN")
    1636                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    1637                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1638                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1639                            .dwattr $C$DW$103, DW_AT_decl_line(0x50b)
    1640                            .dwattr $C$DW$103, DW_AT_decl_column(0x11)
    1641                    
    1642                    $C$DW$104       .dwtag  DW_TAG_member
    1643                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$22)
    1644                            .dwattr $C$DW$104, DW_AT_name("RANDOM_NUM_1")
    1645                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("RANDOM_NUM_1")
    1646                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1647                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1648                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1649                            .dwattr $C$DW$104, DW_AT_decl_line(0x50c)
    1650                            .dwattr $C$DW$104, DW_AT_decl_column(0x11)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   31

    1651                    
    1652                    $C$DW$105       .dwtag  DW_TAG_member
    1653                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
    1654                            .dwattr $C$DW$105, DW_AT_name("RANDOM_NUM_2")
    1655                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("RANDOM_NUM_2")
    1656                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
    1657                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1658                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1659                            .dwattr $C$DW$105, DW_AT_decl_line(0x50d)
    1660                            .dwattr $C$DW$105, DW_AT_decl_column(0x11)
    1661                    
    1662                    $C$DW$106       .dwtag  DW_TAG_member
    1663                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$22)
    1664                            .dwattr $C$DW$106, DW_AT_name("RANDOM_NUM_3")
    1665                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("RANDOM_NUM_3")
    1666                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
    1667                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1668                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1669                            .dwattr $C$DW$106, DW_AT_decl_line(0x50e)
    1670                            .dwattr $C$DW$106, DW_AT_decl_column(0x11)
    1671                    
    1672                    $C$DW$107       .dwtag  DW_TAG_member
    1673                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$22)
    1674                            .dwattr $C$DW$107, DW_AT_name("RANDOM_NUM_4")
    1675                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("RANDOM_NUM_4")
    1676                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
    1677                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1678                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1679                            .dwattr $C$DW$107, DW_AT_decl_line(0x50f)
    1680                            .dwattr $C$DW$107, DW_AT_decl_column(0x11)
    1681                    
    1682                    $C$DW$108       .dwtag  DW_TAG_member
    1683                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$22)
    1684                            .dwattr $C$DW$108, DW_AT_name("BSL_CFG_TAG")
    1685                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("BSL_CFG_TAG")
    1686                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
    1687                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1688                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1689                            .dwattr $C$DW$108, DW_AT_decl_line(0x510)
    1690                            .dwattr $C$DW$108, DW_AT_decl_column(0x11)
    1691                    
    1692                    $C$DW$109       .dwtag  DW_TAG_member
    1693                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$22)
    1694                            .dwattr $C$DW$109, DW_AT_name("BSL_CFG_LEN")
    1695                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("BSL_CFG_LEN")
    1696                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    1697                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1698                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1699                            .dwattr $C$DW$109, DW_AT_decl_line(0x511)
    1700                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1701                    
    1702                    $C$DW$110       .dwtag  DW_TAG_member
    1703                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1704                            .dwattr $C$DW$110, DW_AT_name("BSL_PERIPHIF_SEL")
    1705                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("BSL_PERIPHIF_SEL")
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   32

    1706                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
    1707                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1708                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1709                            .dwattr $C$DW$110, DW_AT_decl_line(0x512)
    1710                            .dwattr $C$DW$110, DW_AT_decl_column(0x11)
    1711                    
    1712                    $C$DW$111       .dwtag  DW_TAG_member
    1713                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1714                            .dwattr $C$DW$111, DW_AT_name("BSL_PORTIF_CFG_UART")
    1715                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_UART")
    1716                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
    1717                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1718                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1719                            .dwattr $C$DW$111, DW_AT_decl_line(0x513)
    1720                            .dwattr $C$DW$111, DW_AT_decl_column(0x11)
    1721                    
    1722                    $C$DW$112       .dwtag  DW_TAG_member
    1723                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$22)
    1724                            .dwattr $C$DW$112, DW_AT_name("BSL_PORTIF_CFG_SPI")
    1725                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_SPI")
    1726                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
    1727                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1728                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1729                            .dwattr $C$DW$112, DW_AT_decl_line(0x514)
    1730                            .dwattr $C$DW$112, DW_AT_decl_column(0x11)
    1731                    
    1732                    $C$DW$113       .dwtag  DW_TAG_member
    1733                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$22)
    1734                            .dwattr $C$DW$113, DW_AT_name("BSL_PORTIF_CFG_I2C")
    1735                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("BSL_PORTIF_CFG_I2C")
    1736                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
    1737                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1738                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1739                            .dwattr $C$DW$113, DW_AT_decl_line(0x515)
    1740                            .dwattr $C$DW$113, DW_AT_decl_column(0x11)
    1741                    
    1742                    $C$DW$114       .dwtag  DW_TAG_member
    1743                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1744                            .dwattr $C$DW$114, DW_AT_name("TLV_END")
    1745                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("TLV_END")
    1746                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
    1747                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1748                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1749                            .dwattr $C$DW$114, DW_AT_decl_line(0x516)
    1750                            .dwattr $C$DW$114, DW_AT_decl_column(0x11)
    1751                    
    1752                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1753                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x4c3)
    1754                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1755                            .dwendtag $C$DW$T$25
    1756                    
    1757                    $C$DW$T$174     .dwtag  DW_TAG_typedef
    1758                            .dwattr $C$DW$T$174, DW_AT_name("TLV_Type")
    1759                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$25)
    1760                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.6 Tue Mar 24 14:16:50 2026

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
system_msp432p401r.asm                                               PAGE   33

    1761                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:\ti\ccsv7\ccs_base\arm\include\msp432p401r.h")
    1762                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x517)
    1763                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x03)
    1764                    
    1765                    
    1766                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1767                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x8c)
    1768                    $C$DW$115       .dwtag  DW_TAG_member
    1769                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1770                            .dwattr $C$DW$115, DW_AT_name("CPUID")
    1771                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("CPUID")
    1772                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1773                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1774                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1775                            .dwattr $C$DW$115, DW_AT_decl_line(0x1b8)
    1776                            .dwattr $C$DW$115, DW_AT_decl_column(0x12)
    1777                    
    1778                    $C$DW$116       .dwtag  DW_TAG_member
    1779                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1780                            .dwattr $C$DW$116, DW_AT_name("ICSR")
    1781                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ICSR")
    1782                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1783                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1784                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1785                            .dwattr $C$DW$116, DW_AT_decl_line(0x1b9)
    1786                            .dwattr $C$DW$116, DW_AT_decl_column(0x12)
    1787                    
    1788                    $C$DW$117       .dwtag  DW_TAG_member
    1789                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    1790                            .dwattr $C$DW$117, DW_AT_name("VTOR")
    1791                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("VTOR")
    1792                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1793                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1794                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1795                            .dwattr $C$DW$117, DW_AT_decl_line(0x1ba)
    1796                            .dwattr $C$DW$117, DW_AT_decl_column(0x12)
    1797                    
    1798                    $C$DW$118       .dwtag  DW_TAG_member
    1799                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    1800                            .dwattr $C$DW$118, DW_AT_name("AIRCR")
    1801                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("AIRCR")
    1802                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1803                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1804                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccsv7/ccs_base/arm/include/CMSIS/core_cm4.h")
    1805                            .dwattr $C$DW$118, DW_AT_decl_line(0x1bb)
    1806                            .dwattr $C$DW$118, DW_AT_decl_column(0x12)
    1807                    
    1808                    $C$DW$119       .dwtag  DW_TAG_member
    1809                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
